[{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQG9cz3gUawTkQ/company-logo_100_100/0/1624608476213?e=1640217600&v=beta&t=geyQI0nHbJ6UlWiZEHrxhNfCbNCnyIEVZ3RXqt7mhqg",
    "link": "https://www.linkedin.com/jobs/view/2728469060/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=peHuDcb7HfRhZJLgPn2YUA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Posted by\nSebastian Thimm\nHead of Operations at Neodigital Versicherung AG\nSend InMail\nSOFTWAREENTWICKLER:IN (M/W/D) - PL/SQL\nDu interessierst Dich für die Entwicklung hochmoderner Frameworks und Datenbanklösungen?\nDu teilst unsere Begeisterung für neue Technologien und willst unsere digitale Versicherung mit uns ausbauen?\nDu arbeitest gerne in einem dynamischen Team mit agilen Arbeitsmethoden?\nDann bist Du bei uns genau richtig!\nhttps://neodigital.de/2021/05/06/softwareentwickler-in-m-w-d-pl-sql/",
    "title": "Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQHimoOhlKAbCA/company-logo_100_100/0/1579357811819?e=1640217600&v=beta&t=0bDgFUE3Iy2XBJsVUc1IHAsamJkB9sa6RdL6mHtmQPA",
    "link": "https://www.linkedin.com/jobs/view/2724610481/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=3bsZKbkqbCtXRKj1n9uQhQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job description\nAlways had a passion for building things? Looking for a thrilling challenge in a fast-growing environment? Then we have the right challenge for you!\nWe are seeking an experienced IT professional to help us support our membership program and develop our data project. You will work on different projects that will have a direct effect on how G2 engages and rewards its users. If you have experience developing mobile applications, data projects and web based applications you are the person we are looking for. \nThe role will be located in our HQ in Berlin, Germany and the ideal start date is as early as possible.\n Responsibilities\nHelp develop multiple projects in our pipeline\nEnlarge and expand the current G2 data project\nHelp manage relationships with external agencies\nCoordinate internal resources and third parties/vendors for the flawless execution of projects\nResearch relevant industry experts, competitors, target audience and users\nBrainstorm new, creative approaches to our IT solutions \n Requirements\nMust have\nEducation: BS / BA in IT\nExperience: 3+ years of experience in developing websites, applications and data projects \nProven track record of successful projects meaning you have applications, websites and data projects you developed alone or in a team and can present to us\nIn-depth knowledge of the following tools and platforms:\nModern Web Frameworks\nHybrid (React Native) or native app development (both IOS and Android)\nBI-Tools and data storage knowledge\nIn-depth knowledge of the following languages and frameworks:\nHTML5 / CSS / JavaScript\nSQL\nHighly structured and can work well both autonomously and in a team environment\n\nGood to have\nExperienced working with analytics tools (Salesforce, Netbase, Socialbakers, GA)\nExperience with the following languages and frameworks:\nPython\nExperience with the following tools and platforms:\nShopify\nAWS\nDevOps experience\nAbility to start as soon as possible\nE-commerce experience\nAvid gamer\n\nWhat is like working at G2 Esports?\n\nWork Culture. You will be surrounded by experienced, successful and ambitious co-workers that will push you to your limits in a positive and inspiring working atmosphere. A workplace where unity, honesty, pioneering, fairness and integrity are valued.\n\nPerks. Competitive salary; office in the heart of Berlin; gym membership; great IT equipment; flexible working times; additional holidays & being a part of the G2 family.\n\nDevelopment. Get mentored by some of the best within esport and access a wide network of great people and companies inside and outside of the industry.",
    "title": "Full Stack Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQEgATRz8ewb2g/company-logo_100_100/0/1631784151437?e=1640217600&v=beta&t=YN2_2PnGFzpGg2yo3QAEBOE_-ccQZYPR4GX6p4pLnIE",
    "link": "https://www.linkedin.com/jobs/view/2728486232/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=14be%2F91YZvF25q0J7YTt6Q%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Before applying, see https://youtu.be/J7-gIa6jiP0.\n\nThe Laurel provides the infrastructure for any volunteering project that wants to reward its volunteers with global, immutable, provable proofs of merit.\n\nWe use blockchain technology and other web3 tools to ensure immutability and protocol decentralization. The Laurel protocol tackles continuous voting, proof creation, new mechanisms of game theory focused on incentivizing generosity, distributed computing issues.\n\nThe Laurel is built by volunteers, awarded with generosity and meta-generosity points - laurels and medals.\n\nIf you join The Laurel's team of volunteers, your generosity will be part of the next moral revolution.\n\nIf you are a software engineer, your challenges will be:\nblockchain technology, especially Ethereum: ethers.js, Solidity, Yul, EVM assembly - we are building our own EVM interpreted functional language (for both on and off-chain)\nJavaScript, Node.js, React.js\nReact Native - we are building a programable chat application and wallet, using web3 technologies\nRust, WebAssembly\n\nPlease be punctual.\nWe appreciate people who do not shy away from necessary conflict.",
    "title": "Volunteer Software Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQFEhgRYWOqq3Q/company-logo_100_100/0/1625162475183?e=1640217600&v=beta&t=ymkFCkSOPRB_8PcEindMejdDr_FtexRID3wIYsfvQDU",
    "link": "https://www.linkedin.com/jobs/view/2723281902/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=a0PvgeyM4rjwUUGcuSPq7Q%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "About Datadog:\n\nWe're on a mission to build the best platform in the world for engineers to understand and scale their systems, applications, and teams. We operate at high scale—trillions of data points per day—allowing for seamless collaboration and problem-solving among Dev, Ops and Security teams globally for tens of thousands of companies. Our engineering culture values pragmatism, honesty, and simplicity to solve hard problems the right way.\n\nThe Team:\n\nThe Adversary Simulation Engineering team helps keep Datadog safe by developing tools and frameworks to automate discovery of infrastructure exposure, identify vulnerabilities, and simulate real life attacks within the organization.\n\nThe Opportunity:\n\nAs a software engineer for the Adversary Simulation Engineering team, you will design, build and integrate tools for various attack phases (reconnaissance, infiltration, persistence), and deploy them on immutable infrastructure. You will collaborate with other security teams to understand the evolving security evasion needs and implement them in offensive tools and systems.\n\nWe're looking for engineers experienced in modern infrastructure tech, cloud environments, and distributed systems with an adversarial security mindset.\n\nYou Will:\nDesign, develop, and maintain automated infrastructure, systems and services that improve offensive security capabilities\nPrototype new ideas, test new open-source offensive security tools and improve existing ones\nWork across the stack to deliver new adversarial features from start-to-finish\nResearch and monitor emerging trends and techniques in offensive tooling\n\nYou Are:\nYou have demonstrated significant experience in full stack software development\nYou are fluent in one or more programming experience (Golang, Python, JavaScript etc)\nYou have architected, built, and operated systems to solve problems at scale\nExperience with immutable infrastructure deployments and cloud automation technologies, such as Terraform\nHigh level understanding of the security principles of at least one AWS, GCP, Azure\nYou are able to work both independently and collaboratively\nYou want to work in a fast, high growth environment\n\nBonus Points:\nYou have developed offensive tooling\nYou have knowledge of offensive security concepts\nYou've lead complex projects with a team of engineers\nOCSP, CEH or similar pentesting certifications\n\nThis is a remote position\n\nEqual Opportunity at Datadog:\n\nDatadog is an Affirmative Action and Equal Opportunity Employer and is proud to offer equal employment opportunity to everyone regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, and more. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\n\nYour Privacy:\n\nAny information you submit to Datadog as part of your application will be processed in accordance with Datadog’s Applicant and Candidate Privacy Notice.",
    "title": "Software Engineer - Adversary Simulation Engineering"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQHigW_IbFLSBA/company-logo_100_100/0/1615285336384?e=1640217600&v=beta&t=IcD4WSqNifVFUdhDGUTuSDjUHGyMR0n9DZutMAAM3GA",
    "link": "https://www.linkedin.com/jobs/view/2723205312/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=1RZw7h9QgdRQuT5O5avNIw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "EVOCAL Health is a digital diagnostics company with the mission of unlocking the human voice as a prognostic and diagnostic biomarker. Using innovative technology, we develop clinically-proven digital diagnostic and therapeutic concepts using Vocal Biomarkers and Artificial Intelligence to create interventions to prevent, predict and manage health.\n\nOur first product will be one of the first digital health applications that are approved as a medical device and help patients with (chronic) diseases through a multi-modal and guideline based digital therapy concept. Our mobile app gives users access to a diagnostic and therapeutic solution, that digitizes the \"gold standard\" of therapies. The app is based on our AI powered algorithm, that diagnoses health using the human voice and a smartphone. In the near future, we will release digital therapies in the fields of respiratory, cardiovascular and neurodegenerative diseases.\n\nOur team combines expertise in artificial intelligence, machine learning, product management, medicine, engineering and computer science to envision and design the next generation of healthcare tools and services. We partner with leading research facilities, life sciences organizations, healthcare providers and governmental organizations to enable fast development, meaningful stakeholder integrations and development at scale.\n\nToday we have been voted one of the fastest growing startups in Germany and are an innovation leader in the field of digital therapeutics. We are founded by experienced healthcare professionals, have raised initial capital from investors and are currently building an exceptional team based in Hamburg and Göttingen (Germany): A team to join our mission to unlock the human voice as a biomarker for health and make longevity accessible.\n\nTasks\n\nAs a Software Engineer at EVOCAL Health, you will help develop, build and iterate the product within an interdisciplinary and emerging team across all of EVOCAL’s departments to support planning, development and execution.\n\nYou will use your software engineering expertise to develop software that helps patients understand their disease and manage their health, as well as further develop our digital therapeutics platform based on a patient-centric product vision.\nActively participate in product development and iteration within a cross-functional, self-managed team by participating in concept work and implementation for the back and frontend of our application\nContribute to the development of the digital therapeutics platform based on Ruby on Rails, including architectural decisions based on a patient-centric product vision\nRequirements\nDeep technical knowledge of backend development using Ruby on Rails with software architecture & data modelling skills, and the ability to make software engineering decisions on product vision\nWillingness and ability to work in a cross-functional, product-focused team, and the ability to actively participate in the conceptualization in the health and medical context\nCommunication skills in English\nAdditional Qualifications\nExperience in software development in the medical device environment and experience with quality-driven software development and its regulatory framework\nBenefits\nThe opportunity to have a positive impact on solving one of our world’s biggest challenges: Enabling humans and patients to live a longer and healthier life and thereby contributing to one of the UNs most impactful SDGs\nProviding patients with remote access to gold standard therapies, managing chronic conditions and play a vital role in the design of a new kind of digital health applications based on scientific insights and real-world evidence\nAttractive salary with 30 days holiday per year, flexible working hours, home office policy, and a working environment, that is oriented on work outcomes\nPersonal training and development in a motivated, interdisciplinary team in a fast-growing digital health startup environment\nA working environment, that values diversity and empowers everyone to be their authentic self as a key ingredient for personal development and company success\nWe are looking forward to your application and hope to get to know you personally.",
    "title": "SOFTWARE ENGINEER (m/f/d) at EVOCAL Health"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQEvfE9WNUeNYw/company-logo_100_100/0/1519855921040?e=1640217600&v=beta&t=d8pjxAq2KBDEjfgcMacaeEtRj4XYc5D2vzzic04CvaA",
    "link": "https://www.linkedin.com/jobs/view/2714070803/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=DppsDTiyYyGJEx0UdaWm%2BA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Product And Responsibilities\n\nOpSpace is a Barco product easing the daily work of a control room operator. It is a distributed system based on Linux which provides freely configurable workplaces integrating all kind of application and video sources along with a highly efficient UI allowing fast interaction in mission critical environment. Each workplace can be composed of multiple hardware clients and has multiple server-backends. Integrated into a highly efficient UI OpSpace offers various application and video sources, which can be customized, shared between users and used concurrently in the same workplace. To further increase functionality of OpSpace, Barco is looking for a Software Developer Backend (m/w/d).\n\nYour responsibility is to design, implement and maintain OpSpace backend using latest technologies. Since the result of your work is part of a bigger system, you need to align and integrate with work result of other teams.\n\nFunction\n\nYou will be part of an agile R&D team working in a modern environment on the development of software products for video wall applications and operator workplaces used in critical infrastructure. Your team will be based in Karlsruhe/Germany, with close relations to Barco headquarter in Belgium and our development site in India.\n\nYour daily work will be in an agile scrum team developing simple and timely solutions to complex problems to maintain Barco's market leadership in video wall solutions. You will be part of an agile software organization that focuses on ownership and team responsibility instead of hiding behind cumbersome processes.\n\nQualifications\nMaster degree or equivalent in a relevant technical discipline\nAble to work in a multicultural environment\nFluent in English\nGood communications skills\nGood knowledge of Python and GIT\nInterest in backend development\nPreferably some experience with Java and JavaScript\nPreferably some experience with Jenkins and Test Driven Design\nPreferably some administrational knowledge in Linux and MongoDB\nOur Offer\nA permanent contract with a fair salary\nWorking with modern tools in an agile software development process\nCollaboration on high-quality products for the industrial environment\nAn interesting and challenging job in a flexible working environment\nMembership of a highly motivated, interdisciplinary and international team\nInternal training in our Barco University",
    "title": "Software Developer Backend (m/f/d)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQEjA9gGCAPe7Q/company-logo_100_100/0/1625134957016?e=1640217600&v=beta&t=ir2ppLxoonR8TJHE_oC0CiABMKQ90EXhvBFDf7V7OLg",
    "link": "https://www.linkedin.com/jobs/view/2714599969/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=WVCWm2eldeLmgHOc%2FF02ng%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Snke OS™ is a universally deployable digital B2B platform, founded in 2020 & headquartered in Munich. Emerging technologies continue to drive a digital transformation in the healthcare economy. Our founders recognized the potential for value creation by decoupling & deploying their best-in-class platform & team so that other companies can scale up & innovate efficiently. Fueled by AI & big data analytics, Snke OS delivers the platform & infrastructure that enables partners across the healthcare industry to deploy digital solutions for safer & more efficient interventions.\n\nThe 150-person Snke OS team brings a wealth of experience to the new company with backgrounds in large platforms, digital health & software-driven medical technology. Let’s impact the industry together! We are looking for pioneers to lead fast & lead first with Snke OS.\n\nSoftware Engineer – Data Management\n\nWhat To Expect\n\nAs Software Engineer you will be part of our Data Management team. Together with your team mates you will create and maintain a data management framework that builds the foundation of all our applications.\n\nThe data management framework contains components and services which read, write, convert and process medical information. One side of the interface is typically represented by standard medical data formats like DICOM, HL7 and FHIR . The other side of the interface are either applications directly building on top of the data management framework, or services and micro-services providing, among others, gRPC APIs or web based interfaces like REST APIs to build a mesh of capabilities representing the core of our new SnkeOS Heathcare Platform which is being utilized by several new medical applications. This of course includes additional aspects like cyber security considerations, data persistence, interprocess-communication and concurrent programming as well.\n\nExpect to be challenged on a daily basis by your colleagues – experts on medical data, technical enthusiasts with a broad skill set, product owners and project engineers with a lot of knowledge on building highly innovative medical products. We work together, with an open mindset, always striving for the best possible solution.\n\nWhen joining this position, you will\nDevelop software in an agile environment\nBuild the next generation of the SnkeOS Heathcare Platform for the global market\nBe able to bring in your view and your expertice by actively contribute to the team especially on technical concepts\nLearn a lot about data management with focus on the medical products\nMake a positive impact by contributing to the healthcare system for the benfit of patients\nHave fun working with great people\nWhat You Offer\nA degree in Computer Science or related discipline, or equivalent working experience\nGood experience in developing software with C++\nKnowledge in other programming languages like C#, JavaScript, Python is preferred\nIdeally experience with REST and/or gRPC\nKnowledge and/or interest in medical data standards such as DICOM, HL7 or FHIR\nInterested in state of the art web technologies like HTTP, REST, JSON or services and micro-services.\nAnalytical mindset and creativity to develop extraordinary solutions\nVery good communication skills in English; German is a strong plus\nWhat We Offer\nCentrally located, modern work spaces\n30 days of vacation plus 24.12. and 31.12.\nHome office and flexible working hours\nFree gym courses with showers and changing rooms\nSecure bicycle storage room\nRestaurant, coffee shop on-site\nRegular after-work, team & company events\nGreat 212m² roof terrace\nInternational team of supportive colleagues\nComprehensive training and continuing education opportunities\nInterested? Then we are looking forward to receiving your online application!\n\nContact person: Daniel Sypli",
    "title": "Software Engineer - Data Management"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQH1fQSlU8Pjug/company-logo_100_100/0/1559031966704?e=1640217600&v=beta&t=P3zztkz9z2EHMym2jPBUKQ6kcx1XvFi5L2STVeOPSmQ",
    "link": "https://www.linkedin.com/jobs/view/2724601400/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=5o07bgQiIZvpIsIvs4DO4g%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Software Architect (f/m/d) in Python with Developer background\nYour tasks: \nYou are a self-motivated python developer and want to join our agile team? You are constantly striving for improvement and eager to implement innovations in a regulated banking environment? Welcome and help us to build and improve our risk platform. You will be part of a team that works in close collaboration with business departments to understand their needs and develop efficient software solutions for them. Pattern and approaches like 12 factor app, domain driven design and clean code comes natural to you? As one of our Python experts you will lead the planning, designing, and development our new target technologic Platform. After all, we value the exchange of ideas, being there for each other and encouraging each other to become better. We call it: the exchange mindset. \n You bring along:\nSeveral years of working experience in development and design of backend solutions \nExperience with scalable applications and the concepts of containerized, service-oriented, microservices architectures\nSolid knowledge in Python 3.7 or higher\nBroad knowledge of opensource products (like Flask or Django)\nFocus on detail and passion to use and write maintainable and high-quality software\nTeam player and show initiative & ownership in a dynamic, agile environment\nExcellent communication skills both written and verbal in German and English\n We offer you:\nAttractive salary package with many benefits including childcare facilities, meal allowance, job ticket, sport and recreational events\nPersonal development thanks to extensive further training opportunities\nA place in a dynamic and international team within EEX Group and Deutsche Börse Group\nA long-term perspective in the constantly growing and evolving energy industry\nBespoke onboarding plan",
    "title": "Python Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQEx2St-EpU6Ww/company-logo_100_100/0/1625038022840?e=1640217600&v=beta&t=oftOjzk315MXearjcpQaH0s17InTxcjx99lqpvjIfoY",
    "link": "https://www.linkedin.com/jobs/view/2718212688/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=2T1gRRQwTi39lD%2BeUS3nDw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Are you a great developer who wants to get real hacking skills? We offer you the place to become an expert!\n\nJob Description\nWe are looking for an ambitious and enthusiastic software developer who would like to further develop his or her skills. You will practice with us and learn how to become an expert on digital identities, trust and security. You will learn how to create architectures that are inherently secure. Doing so, you will become an expert on secure programming. You will contribute to our own SaaS applications with which we reach millions of end users. Our code is mission critical for many of our high-profile customers.\n\nResponsibilities\nThe primary responsibilities will include:\nWrite software that matters! Be part of the team that will enable online authentication for millions of users.\nGet training and guidance to become an expert at writing secure software\nPenetration test our own software, share secure programming knowledge\nAnalyze functional requirements and turn them into real software.\nAssist in designing and improving our software architecture\nBuild and maintain a catalogue of reusable, elegant solution patterns;\nBuild and maintain a library of reusable, elegant software components;\nImprove standards and guidelines for using these patterns and components.\nWe work agile, so take part in daily stand-ups and discuss safety features with the product owner\n\nRequirements\nAt least a Bachelor's degree in Computer Science\n5+ years of experience developing Java/Kotlin web applications\nFluent in German and English\nProgramming is not just your work, it is your hobby and your passion\nYou enjoy explaining things, discussions and knowledge sharing\nYou are a self-starter able to work from high level ideas and concepts\nExperience with Javascript and related tooling, Java 8 and/or Kotlin\nExperience using CI/CD, version control, and unit testing\nExperience with self-sovereign identity protocols, W3C, hyperledger · Familiarity with any of the following technologies and methodologies: Spring Boot, OIDC, Angular, Linux, SCRUM/Kanban, REST, Gitlab, PostgreSQL, QA, SAML\n\nWhat we offer\nWorking at Signicat means committing to an organization with a welcoming atmosphere, with fun and intellectually stimulating colleagues. We communicate informally and know how to find each other easily. We are open to feedback and are very critical. We work hard and with great pleasure.\nCompetitive salary\n25 vacation days\nPension scheme, and bonus\nFast-growing technical organization with a flat organizational structure\nPlenty of room for personal development\nYou will be well taken care of with drinks, fruit, fresh salads and a lunch without a cash register.\n\nAbout Signicat\nSignicat is a Digital Identity Service Provider (DISP) and is one of the leading providers of electronic identity and signature solutions in Europe/globally. Our security solutions are used at all levels from government and big banks to small business—and everywhere in between. We continue to be leaders in innovative security solutions, reducing risk while providing a smart and intuitive user experience. Signicat has earned the trust of institutions and businesses by providing user authentication, electronic signing, identity proofing and document preservation.\nWe are a fast-growing company that has a track record of success as one of the most complete providers of electronic identification services for the Nordic and European markets. While enjoying continued growth we have kept the best of our ‘startup’ ethos, encouraging creativity, initiative and independence to get things done. We value the well-being of each employee and all work together to create a supportive and inspiring work environment.\nSignicat has almost 250 employees at offices in Trondheim (headquarters), Oslo, Bergen, Copenhagen, Helsinki, Stockholm, Rotterdam, Munich, Lisbon and Bucharest. Our focus is security and professionalism and we are constantly working to improve our product and ourselves.\nPlease use the application-link, upload your CV and write some words about why you may be interested in working with us. If you want to be part of our highly talented, professional and creative team, then we want to hear from you!\nNo recruitment companies please.",
    "title": "Java/Kotlin software developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQFuNO1soMnTUg/company-logo_100_100/0/1610030713320?e=1640217600&v=beta&t=07hOxDOQ3QLTDePGU6gNxdnMa_TU79QelnU0st6hIMA",
    "link": "https://www.linkedin.com/jobs/view/2721125956/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=uDnQHMHXJ0VQjLk7c6McyA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Aufgaben\nDu brennst für die objektorientierte Programmierung, hast Spaß daran, dein Wissen und deine Erfahrung in der agilen Softwareentwicklung einzubringen und kannst dich für die neuesten Technologien und Trends in der IT begeistern.\nNutze dein Know-How in der Softwareentwicklung und bringe es in einem agilen Umfeld ein\nIm Rahmen deiner Aufgaben setzt du den Fokus auf die innovative Neu- und Weiterentwicklung unserer Produktkomponenten\nDie hochwertige Qualität unserer Softwarelösungen sicherst du durch regelmäßiges Testen\nDu gestaltest den Softwareentwicklungsprozess und unsere internen Prozesse aktiv mit und arbeitest an hochinteressanten und fachlich anspruchsvollen Projekten\n\nBenefits\nWir bieten dir ein attraktives Gehalt und bezuschussen deine monatliche Sporteinheit\nRegelmäßige und systematische (externe und interne) Weiterbildungsmöglichkeiten\nModernes Arbeiten in einem innovativen und internationalen Team\n\nQualifikationen\nNach deinem erfolgreich abgeschlossenem Studium der (Wirtschafts-) Informatik, Mathematik, Physik oder einem ähnlichen Studienfach möchtest du voll durchstarten\nDu konntest bereits erste praktische Erfahrungen in der Programmierung sammeln und hast gute Kenntnisse in zumindest einer objektorientierten Sprache (z.B. Java)\nIdealerweise hast du auch Kenntnisse in C++, Webentwicklung (HTML5, CSS, JavaScript, GUI-Frameworks)\nEine selbständige und zielgerichtete Arbeitsweise, Kommunikationsstärke und Teamfähigkeit zeichnen dich aus\nDu bist bereit, national zu reisen\nSehr gute Deutsch- und Englischkenntnisse\n\nMacros Reply: Digitalisierung & Automatisierung\nMacros Reply ist Experte in der Digitalisierung und Automatisierung von Geschäftsprozessen für Versicherungen und Finanzdienstleister. Um deren hohen Anspruch gerecht zu werden, entwickelt Macros Reply für die Kernfunktionalitäten eigene, flexibel konfigurierbare Software und ergänzt diese mit Lösungen von ausgewählten, geprüften und langjährigen Partnern. Mittels innovativen Technologien wie Process Mining, Robotic Process Automation (RPA) und Machine Learning hilft Macros seinen Kunden sich in moderne, schnell agierende Unternehmen zu verwandeln: Die Sachbearbeitung wird von Routine-Arbeiten entlastet und bei wertschöpfenden Tätigkeiten unterstützt, ebenso profitiert der Kunde von deutlich verkürzten Bearbeitungszeiten. Macros Reply steht auch für: ECM, Vorgangsbearbeitung & DMS, Verteilregelwerke, Workflows & Prozessmanagement, elektronische Akten & Postkörbe, sowie Archivierung.",
    "title": "Junior Softwareentwickler (m/w/d)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQFuNO1soMnTUg/company-logo_100_100/0/1610030713320?e=1640217600&v=beta&t=07hOxDOQ3QLTDePGU6gNxdnMa_TU79QelnU0st6hIMA",
    "link": "https://www.linkedin.com/jobs/view/2721125956/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=uDnQHMHXJ0VQjLk7c6McyA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Posted by\nLuisa Bauer\nHuman Resources / Recruiting bei Reply\nSend InMail\nAufgaben\nDu brennst für die objektorientierte Programmierung, hast Spaß daran, dein Wissen und deine Erfahrung in der agilen Softwareentwicklung einzubringen und kannst dich für die neuesten Technologien und Trends in der IT begeistern.\nNutze dein Know-How in der Softwareentwicklung und bringe es in einem agilen Umfeld ein\nIm Rahmen deiner Aufgaben setzt du den Fokus auf die innovative Neu- und Weiterentwicklung unserer Produktkomponenten\nDie hochwertige Qualität unserer Softwarelösungen sicherst du durch regelmäßiges Testen\nDu gestaltest den Softwareentwicklungsprozess und unsere internen Prozesse aktiv mit und arbeitest an hochinteressanten und fachlich anspruchsvollen Projekten\n\nBenefits\nWir bieten dir ein attraktives Gehalt und bezuschussen deine monatliche Sporteinheit\nRegelmäßige und systematische (externe und interne) Weiterbildungsmöglichkeiten\nModernes Arbeiten in einem innovativen und internationalen Team\n\nQualifikationen\nNach deinem erfolgreich abgeschlossenem Studium der (Wirtschafts-) Informatik, Mathematik, Physik oder einem ähnlichen Studienfach möchtest du voll durchstarten\nDu konntest bereits erste praktische Erfahrungen in der Programmierung sammeln und hast gute Kenntnisse in zumindest einer objektorientierten Sprache (z.B. Java)\nIdealerweise hast du auch Kenntnisse in C++, Webentwicklung (HTML5, CSS, JavaScript, GUI-Frameworks)\nEine selbständige und zielgerichtete Arbeitsweise, Kommunikationsstärke und Teamfähigkeit zeichnen dich aus\nDu bist bereit, national zu reisen\nSehr gute Deutsch- und Englischkenntnisse\n\nMacros Reply: Digitalisierung & Automatisierung\nMacros Reply ist Experte in der Digitalisierung und Automatisierung von Geschäftsprozessen für Versicherungen und Finanzdienstleister. Um deren hohen Anspruch gerecht zu werden, entwickelt Macros Reply für die Kernfunktionalitäten eigene, flexibel konfigurierbare Software und ergänzt diese mit Lösungen von ausgewählten, geprüften und langjährigen Partnern. Mittels innovativen Technologien wie Process Mining, Robotic Process Automation (RPA) und Machine Learning hilft Macros seinen Kunden sich in moderne, schnell agierende Unternehmen zu verwandeln: Die Sachbearbeitung wird von Routine-Arbeiten entlastet und bei wertschöpfenden Tätigkeiten unterstützt, ebenso profitiert der Kunde von deutlich verkürzten Bearbeitungszeiten. Macros Reply steht auch für: ECM, Vorgangsbearbeitung & DMS, Verteilregelwerke, Workflows & Prozessmanagement, elektronische Akten & Postkörbe, sowie Archivierung.",
    "title": "Junior Softwareentwickler (m/w/d)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQEvF6oZFHCC5w/company-logo_100_100/0/1629100053672?e=1640217600&v=beta&t=g223wW7F__h__u71ro_T5VdUXoo0qnMBeWTC9c1vREs",
    "link": "https://www.linkedin.com/jobs/view/2712844948/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=GzNoCgMba5WZGmCUFGolKQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "The Elgato Stream Deck is the premier control device for the majority of the world’s most popular streamers and online content creators. We are looking for a Junior Software Engineer to join our Stream Deck core development team. In this position you will use your creativity, ingenuity, and full skill set to contribute directly to the industry leading software that powers Stream Deck and the SDK used by our 3rd party plugin developers. \n\nWhat you will be working on \nYour main objective is the development of cross-platform macOS and Windows desktop applications in C++ \nWeYou will use the Qt framework to abstract platform dependent functions such as the UI \nYou can work throughout the entire software stack from hardware support to user interface \nYou can work on the core application, the integrated web host, and the fusion of them both \nYou may make improvements to the Stream Deck SDK to empower future plugins \nIntegrate new Stream Deck devices into our ecosystem \nContribute to products that are highly loved by our customers and share in their delight at your work \n\nWhat we are looking for \nUniversity degree in computer science, software engineering, or equivalent education or professional experience \nConfident skills in C++; Python 3.x and Javascript experience is beneficial \nStrong drive to write clean code based around architectural magnificence \nExperience with programming Qt Widgets is beneficial \nInterest in Elgato products, being a user If you are aof Stream Deck is a plus user then this is very interesting \nExperience developing software on macOS or Windows is beneficial \nFluency in both written and spoken English; German skills are an advantage.\n\nAbout Us\nElgato is the brand of choice for video production technology among content creators on all platforms. If you’ve watched live gaming or any streaming content on YouTube or Twitch, chances are we helped make it shine.\nOur mission is to empower content creators everywhere. Be part of the team that makes this happen.\nIn 2018, Elgato was acquired by Corsair, a provider of high-performance PCs and peripherals. Over the last three decades Corsair has cemented its leadership position in its key markets and continues to grow rapidly. As a semi-autonomous division of Corsair, Elgato has engineering offices in Munich and Mönchengladbach in Germany, and in California, and we distribute our products in over eighty countries around the globe.\nElgato’s award winning product range combines cutting edge technologies with industry leading industrial design and user experiences to deliver an unparalleled level of performance to customers. Our focus is always on simplicity and enabling the best possible workflow for content creators.\n\nWhat we offer you\nFlexible working hours and a friendly, positive working environment\nA focus on personal development and training in any relevant discipline\nModern and comfortable offices in the center of Munich and Mönchengladbach\nDiscounts on Elgato, Corsair, Origin, and Scuf Gaming products\nGreat coffee on tap, drinks, fruit, catered team lunch on Fridays and discounted lunch vouchers on other days.",
    "title": "Junior Software Engineer - Stream Deck (m/f/d)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQHdLS5ukQbdOQ/company-logo_100_100/0/1576678791527?e=1640217600&v=beta&t=R6S4ByTdhBlDMUJPBnNW1HVVhFi-kY3vxxFof9607Do",
    "link": "https://www.linkedin.com/jobs/view/2724608742/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=OhVBEvKPkCO1mL%2B5GLjFjg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Flutter. Software engineering.\n\nNew Venture, focusing on solving one of the biggest problems of the German/ European healthcare system. Work with a small world class team, enjoy modern and smart work environment, a 4 day work-week, a motivated and young team, 100% remote working option.",
    "title": "Softwareingenieur"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQGaIIl1YxuxmQ/company-logo_100_100/0/1625159100110?e=1640217600&v=beta&t=2xDgf0sj5ncb5z4RAzmh-0w8vuSBXqEgVJTweLozxPI",
    "link": "https://www.linkedin.com/jobs/view/2724660885/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=xd14gWqW%2F2rtMQngA6bs2w%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "There is only one Data Cloud. Snowflake’s founders started from scratch and designed a data platform built for the cloud that is effective, affordable, and accessible to all data users. But it didn’t stop there. They engineered Snowflake to power the Data Cloud, where thousands of organizations unlock the value of their data with near-unlimited scale, concurrency, and performance. This is our vision: a world with endless insights to tackle the challenges and opportunities of today and reveal the possibilities of tomorrow.\n\nWe’re looking for experienced Software Engineers to join our growing team working on delivering expanding Snowflakes’s Geospatial analysis capabilities in Berlin, Germany. The team is responsible for extending spatial features and enhancing query optimization and query execution techniques to further enhance performance. This role offers a unique opportunity to make a significant impact to Snowflake in a rapidly growing area for location-aware analytic applications.\n\nAS A GEOSPATIAL QUERY PROCESSING ENGINEER AT SNOWFLAKE YOU WILL:\nDesign, develop and extend Snowflake’s geospatial data processing engine using novel and sophisticated new algorithms\nAnalyze and understand performance and scalability bottlenecks in the system and drive resolution of them.\nSupport our customers by pinpointing problems, instrumenting relevant components as needed, and ultimately implementing solutions to the issues identified.\nDeal with issues from logical representation of the execution plan to efficient resource management, all the way down to highly specialized vectorized execution.\nEvaluate and determine priorities with a critical understanding of where performance matters while retaining ease-of-use and system reliability\nOur Ideal Geospatial Query Processing Engineer Will Have\n2+ years hands-on software engineering experience.\nExperience with Geospatial Information Systems and geospatial libraries as well as solutions of common geospatial problems.\nBackground in database internals or building core components for large scale data processing systems (i.e. Hadoop, Spark), especially query execution/processing, and/or optimization.\nStrong CS fundamentals including data structures, algorithms, and distributed systems.\nSystems programming skills including multi-threading, concurrency, etc.\nFluency in C++ or C, and Java\nExtremely strong problem solving and troubleshooting skills\nExcellent interpersonal communication skills\nOutstanding written and oral English language skills\nBS in Computer Science; Masters or PhD Preferred.\nBonus Points For The Following\nStrong database fundamentals including SQL, performance, multi-threading, and schema design.\nExperience using big data storage technologies and their applications (HDFS, Cassandra, Columnar Databases, etc.)\nGerman language skills\nExperience reading and integrating data from multiple sources.\nWHY JOIN THE QUERY PROCESSING TEAM AT SNOWFLAKE?\n\nAs a Member Of Our Team, You Will\n\nWhy join the engineering team at Snowflake. Building new enterprise technologies is complex, and our engineering team surmounts the obstacles.\nBuild an industry-leading data management system that customers love.\nSolve challenging technical problems related to security, parallel and distributed systems, programming, resource management, large-scale system maintenance, and more!\nLearn about and contribute to:\nSuper-robust and secure enterprise SaaS platform that services hundreds of customers and millions of complex queries daily.\nHighly-scalable and reliable data processing platform that runs on hundreds and thousands of machines.\nJoin a world-class team of both industry veterans and rising stars.\nSnowflake is growing fast, and we’re scaling our team to help enable and accelerate our growth. We are looking for people who share our values, challenge ordinary thinking, and push the pace of innovation while building a future for themselves and Snowflake.\n\nHow do you want to make your impact?",
    "title": "Software Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQF2OAQOqLJOdA/company-logo_100_100/0/1622812155303?e=1640217600&v=beta&t=nszbgjMocN8J7Jy8fKnJdcqONCtnorXQlegRVsiX6fg",
    "link": "https://www.linkedin.com/jobs/view/2724647101/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=dZrHlHGWfgqibp2IppBTeQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "(Berlin) Senior Java Developer - Java - Spring - REST - €80,000\n\n\n\nOpportunity to join a world-class growing e-commerce business as a Senior Java Engineer.\n\n\n\nwe have an innovative and driven team that is using cutting-edge technologies to redefine the market.\n\n\n\nWhat your role will look like:\n\n\n\n\n\nCollaborate and communicate. Drive PoC's and refactoring's and evangelize best practices.\nContribute to the business, s tech stack.\nYou will strive for innovation alongside questions the status-quo and replacing it with modern tech is an inherent part of our day-to-day job.\nJoining a team of strong and experienced team of engineers who operate in Berlin.\nShare ownership of the entire development lifecycle.\nSolve complex problems.\n\n\nYour Skills:\n\nExperienced in Java and the JVM and more comfortably within cloud and microservice environments.\nYou will have major Docker/CI/CD Experience.\nMonitoring and leveraging tracing tools to enable you to ensure quality and excellence.\nMotivated and reflective personality to constantly improve yourself.\nAdvanced knowledge in AWS+ JDK11, PostgreSQL, Jenkins Job DSL, Terraform and Spring Framework is a bonus\nWhat we are offering\n\n\n\nIndividuals who strive for the best while using the latest technologies\nRelocation package support to Germany which includes Visa assistance and help with costs.\nSelf-development Education budget.\nTeam and company events like, company parties, company football, international nights, and hackathons.\n\n\nIf you are ready for a new challenge, apply today!\n\n\n\nContact me at",
    "title": "Software Developer - Java - Berlin - E-commerce (f/m/d)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQF2OAQOqLJOdA/company-logo_100_100/0/1622812155303?e=1640217600&v=beta&t=nszbgjMocN8J7Jy8fKnJdcqONCtnorXQlegRVsiX6fg",
    "link": "https://www.linkedin.com/jobs/view/2724647101/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=dZrHlHGWfgqibp2IppBTeQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Posted by\nAldas Blazys\nRecruitment Consultant @ develop. Hiring In Java 🇩🇪 Aldas@developrec.net\n(Berlin) Senior Java Developer - Java - Spring - REST - €80,000\n\n\n\nOpportunity to join a world-class growing e-commerce business as a Senior Java Engineer.\n\n\n\nwe have an innovative and driven team that is using cutting-edge technologies to redefine the market.\n\n\n\nWhat your role will look like:\n\n\n\n\n\nCollaborate and communicate. Drive PoC's and refactoring's and evangelize best practices.\nContribute to the business, s tech stack.\nYou will strive for innovation alongside questions the status-quo and replacing it with modern tech is an inherent part of our day-to-day job.\nJoining a team of strong and experienced team of engineers who operate in Berlin.\nShare ownership of the entire development lifecycle.\nSolve complex problems.\n\n\nYour Skills:\n\nExperienced in Java and the JVM and more comfortably within cloud and microservice environments.\nYou will have major Docker/CI/CD Experience.\nMonitoring and leveraging tracing tools to enable you to ensure quality and excellence.\nMotivated and reflective personality to constantly improve yourself.\nAdvanced knowledge in AWS+ JDK11, PostgreSQL, Jenkins Job DSL, Terraform and Spring Framework is a bonus\nWhat we are offering\n\n\n\nIndividuals who strive for the best while using the latest technologies\nRelocation package support to Germany which includes Visa assistance and help with costs.\nSelf-development Education budget.\nTeam and company events like, company parties, company football, international nights, and hackathons.\n\n\nIf you are ready for a new challenge, apply today!\n\n\n\nContact me at",
    "title": "Software Developer - Java - Berlin - E-commerce (f/m/d)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQHJHH8x4TJ9yg/company-logo_100_100/0/1591086748739?e=1640217600&v=beta&t=DfnBIMYa5vDwzsTiE2NQZmB_efwe9rmm9KkQawLP8IE",
    "link": "https://www.linkedin.com/jobs/view/2718737078/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=uYAhFxGBAh9ipayRK%2FUxqw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Junior Software Engineer (m/f/d) Quoting & Pricing Sea Logistics | Germany | req79957\n\nJoin our self-responsible and fast-moving agile development team (KANBAN), with focus on the development of high-quality mission-critical products for the global Sea Logistics.\n\n\n\nYOUR ROLE\n\nReliable, high-performance and customer-oriented solutions are the pioneers of our first-class logistics services. Our IT team in Hamburg is a large and important part our success. In this area, specialists ensure our smooth IT operations day after day - and here we develop IT systems in interdisciplinary projects, using modern methods, with which we extend our lead in terms of speed, reliability and customer orientation. Worldwide, as a team, hand in hand with the departments and soon with you.\n\n\n\nYOUR RESPONSIBILITIES\n\nBe involved throughout the entire development lifecycle, from requirements definition through realization to demo and product delivery.\nWork closely with the business department to find the best technical and functional solution for new feature requests.\nTransform business user´s requirements into technical specifications.\nDevelop, test and maintain applications from global Quoting & Pricing Portfolio (Web/Desktop).\nIdentify and propose changes to improve Development Process.\nSolve defects reported from Test and Production Environments.\n\n\nYOUR SKILLS AND EXPERIENCES\n\nProfessional experience in building scalable and reliable IT products (ideally in an agile team).\nCollege degree in technical engineering or equivalent.\nSolid understanding of object-oriented programming, design and architectural patterns.\nHands-on experience with actual Java-Enterprise technologies, like Spring, JPA/Hibernate, Junit and SQL technologies.\nFirst experience with front-end technologies, like Angular, HTML5, or CSS3.\nExperience developing RESTful Web Services, and with environments and tools, like IntelliJ, Git, Maven, Docker and Jenkins.\nProactive attitude and open mindset\nProficient in spoken and written English, German is a plus but not mandatory.\n\n\nGOOD REASON TO JOIN\n\nWe want you to feel comfortable in your working surroundings. Therefore, we are offering you modern offices in the announced Hamburg Hafencity directly adjacent to the Elbe, flexible working hours, mobile working arrangement, a subsidized job ticket for the public transportation as well as a canteen with a broad range of menus. Kühne + Nagel is offering you a custom-made career - through individual planning and supervisors who support and advice you in every way. Personally, you get supported by a lot of work-life-balance offerings, a company pension and a supplementary health insurance.\n\n\n\nABOUT KUEHNE + NAGEL\n\nWith over 74000 employees at some 1,300 locations in over 100 countries, the Kuehne + Nagel Group is one of the world's leading logistics companies.\n\nKühne + Nagel is an employer that offers equal opportunities and values disabled employees to benefit from the diversity in our teams. We believe that you can be a valuable asset for Kühne + Nagel and therefore we are looking forward to your application.\n\n\n\nCONTACT\n\nTheo Zimmermann\n+49 160 4497391",
    "title": "Junior Software Engineer (m/f/d) Sea Logistics"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQHpydJGSgRTFA/company-logo_100_100/0/1631642575308?e=1640217600&v=beta&t=nknhnSB6OegT-mlQwbkHLIhyfjKHP-PO2gUqiaoemos",
    "link": "https://www.linkedin.com/jobs/view/2717052221/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=T8xKaXf3I92R%2B6qlYhkNSQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "LivePerson is a transformational force in how brands and consumers communicate. With over 18,000 brands, including HSBC, Verizon, and Home Depot, we are on a mission to make life easier for people and brands everywhere through trusted Conversational AI. We believe in a future where conversations are the norm for getting your intentions fulfilled - whatever they are.\n\nWe are an innovative, intent-driven company that believes in building the future and we are looking for growth minded, unconventional thinkers, developers and builders to join the team.\n\nYou Will Thrive Here If\nYou can operate in a fast paced, dynamic environment\nYou can build partnerships that move our business forward\nYou build code that is simple, understandable, and clean\nYou see feedback or failure as motivation to learn and to grow\nYou believe data-driven decision making is the norm\nYou relate to our core principles (link) and want to work with Conversational AI experts\nIn This Role You Will\nUse your expert knowledge to design and implement robust highly-available back-end services that scale\nBe responsible and drive the adoption of new and exciting technologies.\nAssess the impact of new features based on metrics that are visualized on our dashboards\nSupport other team members and work together with colleagues around the world to achieve the best results\nYour Qualifications Are\nGood TypeScript or JavaScript coding skills\nInterest in learning about large-scale distributed systems.\nExperience in working with RESTful/Webhook APIs,\nInterest in learning about APIs such as Facebook or Twilio is plus\nExperience with CI, configuration management and containerization solutions.\nAbility to learn new and emerging technologies\nAbility to solve complex development problems and produce the highest quality code while striving to push the technical boundaries of SaaS applications\nAbility to work quickly while maintaining strong attention to detail and accuracy\nStrong communication and organizational skills\nWhy You’ll Love Working Here\n\nLivePerson was named to FastCompany’s World’s most innovative companies of 2020 list for the Artificial Intelligence category. We offer top tier tech & data science colleagues, along with opportunities to push your own limits. We embrace invention and experimentation. Most importantly, you’ll have an ability to make an impact at work and at brands across the globe as we build the future with trusted Conversational AI together.\n\nAt LivePerson, people from diverse backgrounds come together to do their best work and be their authentic selves. We are proud to be an equal opportunity employer.\n\nAll qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.",
    "title": "Software Development Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQHigW_IbFLSBA/company-logo_100_100/0/1615285336384?e=1640217600&v=beta&t=IcD4WSqNifVFUdhDGUTuSDjUHGyMR0n9DZutMAAM3GA",
    "link": "https://www.linkedin.com/jobs/view/2717396537/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=cVOh6tRGrWjPSTAZlE78YA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "OCELL‘s software engineers develop the next-generation technologies that change how millions of hectares of forestry are managed by introducing data-based decision making to improve health and carbon storage capacity. Our products need to handle information at massive scale and extend well beyond classical geodata applications. We are looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system\n\ndesign, networking and data storage, artificial intelligence, UI design and mobile. As a software engineer, you will work on a specific project critical to OCELL’s needs with opportunities to switch teams and projects as you and our fast-paced business grows and evolves. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full stack as we continue to push technology forward. We believe that, in addition to hiring the best talent, a diversity of perspectives, ideas and cultures leads to the creation of better products and services. We hire people who are smart and passionate, and we favor ability and willingness to learn over experience. We are hiring full time positions as well as part time positions for students that are currently enrolled in a master’s degree.\n\nAufgaben\n\nResponsibilities\nUtilize your expertise to engage in and enhance the development of our product’s software components in all fields of software engineering\nCollaborate on scalability issues involving large scale data and processing\nDesign, develop, test, deploy, maintain, and improve software\nQualifikation\n\nMinimum Qualifications\nBachelor‘s degree in Computer Science or equivalent practical experience\nExperience in coding Python, Dart or JavaScript\nAbility to speak and write in English fluently\nAbility to work in a small and agile team with quick decision making\nPreferred Qualifications\nExperience with Flutter\nExperience with additional general purpose programming languages, such as: Kotlin, Swift, Typescript\nStrong competencies in data structures, algorithms, and software design\nExperience with AWS and containerized processing workflows\nExperience with Git, software testing and release processes\nBenefits\n\nBenefits\nWe want our employees to benefit from the success of this company and thus involve you not only with salary but also with virtual shares\nCentral location, with great startup vibes\nOnce the pandemic allows it, we’re going back to regular team activities outdoors\nHave a large influence in the development of a meaningful solution to an urgent topic for humanity\nOur Corporate Culture\n\nOCELL is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability or gender.",
    "title": "Software Developer (f/m/x) at Ocell GmbH"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQHpydJGSgRTFA/company-logo_100_100/0/1631642575308?e=1640217600&v=beta&t=nknhnSB6OegT-mlQwbkHLIhyfjKHP-PO2gUqiaoemos",
    "link": "https://www.linkedin.com/jobs/view/2696913880/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=sA0KBLXRCyN8WO3CtuUapQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "LivePerson is a transformational force in how brands and consumers communicate. With over 18,000 brands, including HSBC, Disney, Verizon, and Home Depot, we are on a mission to make life easier for people and brands everywhere through trusted Conversational AI. We believe in a future where conversations are the norm for getting your intentions fulfilled - whatever they are.\n\nWe are an innovative, intent-driven company that believes in building the future and we are looking for growth minded, unconventional thinkers, developers and builders to join the team.\n\nYou Will Thrive Here If\nYou can operate in a fast paced, dynamic environment\nYou can build partnerships that move our business forward\nYou build code that is simple, understandable, and clean\nYou see feedback or failure as motivation to learn and to grow\nYou believe data-driven decision making is the norm\nYou relate to our core principles (link) and want to work with Conversational AI experts\nConversational Understanding and Automation\n\nWe are a team of software engineers who are passionate about technology, software development and machine learning. We are searching for smart and creative individuals who want to join us in our journey in delivering best automation for Liveperson services and conversations\n\nSoftware Development Engineer (SDE) I\n\nWe are looking for smart, self-motivated software developers to join the Conversational Understanding and Automation team. Good testing expertise, deep knowledge about reactive systems and the ability to work with distributed systems is essential for this role.\n\nAbout You\nYour actions reveal that you are passionate and care about software development.\nYou have a flair for software design and like to talk about and discuss various software topics.\nFor you, software development is more than a job.\nFast Feedback\n\nWhile developing we optimize for fast and data-driven feedback. We prototype and evaluate solution ideas. We capture behaviour in examples. From these scenarios we derive our tests and, preferably, drive them outside-in. We think this is a crucial mindset for a senior position. How do you get feedback from your code? If you have working experience with TDD, we want to know more. How much? Compared to us, how did you do it? What problems did you face? The more the better!\n\nAnalytical Skills\n\nWe depend on code in LivePerson which was built over a long time. We deliberately try to capture the current behavior before adapting it. However, this can be quite hard and requires a lot of skill. We consider this to be one trait of a senior position. If you worked with legacy code, we want to know more. How much? What was your approach? Did you work with it in a recent project? What problems have you faced? The more the better!\n\nThe Role\n\nOur teams are autonomous, self-learning and provide support for the product. You will be part of our on-call and work with stakeholders in a collaborative manner. We recognize that things are not perfect here and we admit that we have challenges which need to be tackled. However, we are continuously improving and learning.\n\nTechnologies we use\n\nHere Is a List Of Technologies We Currently Use\n\nMost of our code is written in Scala and Java. We would be especially interested in candidates from this technological background but are open to other experiences as long as you have a very good understanding of object oriented programming, have experience in functional programming.\nScala, Java 11, Python\nSpark, Kafka Streams, Cassandra, Seldon\nKubernetes, GCP\nJunit 4, Testcontainers\nGit, Github\nJenkins CI/CD\nWhy You’ll Love Working Here\n\nLivePerson was named to FastCompany’s World’s most innovative companies of 2020 list for the Artificial Intelligence category. We offer top tier tech & data science colleagues, along with opportunities to push your own limits. We embrace invention and experimentation. You’ll have great benefits, flexible time off, plus snacks and drinks to keep your mind fresh and stomach full. Most importantly, you’ll have an ability to make an impact at work and at brands across the globe as we build the future with trusted Conversational AI together.\n\nAt LivePerson, people from diverse backgrounds come together to do their best work and be their authentic selves. We are proud to be an equal opportunity employer.\n\nAll qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.",
    "title": "Software Development Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQEgFqxz-vvJ8Q/company-logo_100_100/0/1625135445563?e=1640217600&v=beta&t=vq0HoC91B7pKV-IH6lfXOW7d-s28XCJab6wua5aqP2c",
    "link": "https://www.linkedin.com/jobs/view/2727655797/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=EcNB0vloWO%2FfcygWuU8Pfg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "To Succeed In Reaching Our Targets, We Are Seeking Committed Colleagues Who Can Stand Behind Our Core Values Of Inspiration, Simplicity And Integrity\n\nFounded in Munich, Germany in 1989, Brainlab develops, manufactures and markets software-driven medical technology, enabling access to improved, more efficient, less-invasive patient treatments. Our key to success is our creative, talented and hard-working team, which consists of 1400 dedicated and inspiring individuals in 19 offices worldwide.\n\nSoftware Engineer - Optimization Algorithms\nMunich, Germany\nFull-time\nDepartment: R&D Software\nWhat To Expect\n\nIntegrated in a team of physicists and computer scientists you will:\nwork on the further development of our product portfolio for treatment planning in radiotherapy\ndevelop, evaluate and release new techniques that enable radiation planning to be automated\ndevelop optimization algorithms and data analysis for radiation planning\nWhat You Offer\nyou have completed a degree with a focus on medical physics, physics, computer science or a similar field\nideally, you already have practical experience in the field of radiotherapy, especially in data analysis, optimization and radiation planning\nyou enjoy programming and already have project experience in the programming language C++\nvery good communication skills in Englisch\nyou feel comfortable working in a dedicated team and in a dynamic environment.\nWhat We Offer\nworking in a team of great colleagues who help and support each other\nseeing your work making a positive impact on the daily work of clinicians around the world\n30 days of vacation, plus 24.12. and 31.12.\nflexible working hours\nfree gym courses with showers and changing rooms\nsecure bicycle storage room\nexcellent subsidized restaurant\nregular after-work, team & company events\ncomprehensive training and continuing education opportunities\nA position at Brainlab means that you’ll be part of a professional business environment working together with an excellent international team. You will be a valued member of a team of likeminded individuals. You’ll be assessed fairly and given great opportunities based on your performance.\n\nReady to apply? We look forward to receiving your online application including a motivation letter, your first available start date and desired salary.\n\nContact person: Géraldine Endres",
    "title": "Software Engineer - Optimization Algorithms"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQHrSjDgJ9muOQ/company-logo_100_100/0/1572989408724?e=1640217600&v=beta&t=w7wCt3ZGBLAs4vBfuDnL-OlfU7A0UWaSN7IbaUKgIig",
    "link": "https://www.linkedin.com/jobs/view/2720614984/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=0uHiEGFCrDAfA2yKY09EwA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Together, we can beat cancer.\n\nAt Varian, we bring together the world's best talent to realize our vision of a world without fear of cancer. Together, we work passionately to develop and deliver easy-to-use, efficient oncology solutions. If you want to be part of this important mission, we want to hear from you.\n\nSW Development Engineer for the IDENTIFY product\nDesigns and develops secure software for our patient identification and monitoring solutions in C++\nAnalyzes security risks of our applications, defines technical requirements and designs validation and verification strategies.\nThreat modeling and supports our team in implementing secure products\nEnsures that software meets or exceeds software code quality guidelines\nWorks together in a distributed team with software and quality engineers\nJob Requirements\nDegree in Computer Science, Engineering, or related discipline\nWorking experience in software engineering required\nProficient command in object-oriented programming, C++\nExperience with application or system hardening according to e.g. DISA STIGs\nHands on experience in security architecture\nEnthusiasm and passion for IT-Security and high-quality software development\nGood understanding of Agile and Scrum processes\nWritten and spoken fluency in English\nFighting cancer calls for big ideas.\n\nWe envision a world without fear of cancer. Achieving this vision takes dedication and commitment from all of us, every single day. That's why we celebrate and value the distinctly beautiful and intersectional identities of each of our employees. We are a mirror of our patient-base, which allows us to innovate. Big ideas come from everywhere, and the best ideas are fostered by our unique individual experiences. At Varian, we encourage you to bring your whole self to work and believe your bold and authentic perspective will help to power more victories over cancer.\n\n#TogetherWeFight\n\nPrivacy Statement",
    "title": "Software Engineer (m/f/d) Applications"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQFG3K6b6rW6JA/company-logo_100_100/0/1519902706579?e=1640217600&v=beta&t=foIaxnCYhMwAmTryVUGIlxQ9hXd7JvQeX52p7kkbzDo",
    "link": "https://www.linkedin.com/jobs/view/2719805789/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=KyeJkexdCvjbsOwhW4QUmQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Starting date: immediately YOUR TASKS\nImplementation of Java-Code\nConcepts/ architecture to implement new features\nError-Fixes\n2nd Level Support\nDiscussing the most efficient implementation of new features with the organization\nEstimation of expenses\nRefactoring\nAutomated tests, UnitTests\nParticipating complex software projects, incl. planning,, conception, implementation\nAutonomous handling of technical projects\nExchange and negotiation with external agents\nYOUR EXPERIENCE & SKILLS\nExperience in IT\nExperience as an JAVA-Developer focusing on: Fatclient / server-programming, distributed databases, SQL/Postgres, SWING, optionally Eclipse/RAP\nClean Code\nYOUR BENEFITS\n­Centrally located office: Good transport links to our office in Hamburg's City Süd\n­Partnership: Pleasant working atmosphere and collegial cooperation in an international and dynamic logistics environment as well as many team events and activities (e.g. summer chill & grill, company run, New Year's celebration)\n­Attractive social benefits: HVV-Proficard, capital-forming benefits, restaurant ticket vouchers, holiday pay and much more, mobile working\n­Training and development: Diverse training and development opportunities through individual training and global exchange programs in cooperation with our branches worldwide\n­Refreshments: Fresh fruit daily and free drinks (water, tea and coffee)\n­Fitness and health: Personal training sessions and online sports courses, company bike leasing with JobRad as well as a discounted gym membership\nINTERESTED IN JOINING OUR TEAM?\n\nPlease apply online.\n\nApply Now",
    "title": "Java Developer (m/f/d)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQG5DLfub3jQ-w/company-logo_100_100/0/1625143332877?e=1640217600&v=beta&t=Tdz2EBFNQCmXM8jlTvII6d_rFcRO1s42lem0avLlGi0",
    "link": "https://www.linkedin.com/jobs/view/2708071887/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=%2FPSDG3JWCCR5IUg1icBeEg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "About Care.com \nCare.com is a consumer tech company with heart. We’re on a mission to tackle a human challenge we all face: finding great care for the ones we love. We’re moms and dads and pet parents. We have parents and grandparents, so we understand that everyone, at some point in their lives, could use a helping hand. Our culture and our products reflect that.\n\nHere, entrepreneurs, self-starters, teammates, and big thinkers unite behind a common cause. Here, we’re applying data analytics, AI and the latest technologies to solve universal problems and connect people in new ways. If you like having autonomy, if you thrive with collaboration and building new things, and if you’re all about using your talent for good, Care.com is the place for you. We are searching for Software Engineer l, II, Senior, Principal, and Architect Level Engineers!\n\nWhat you believe in:\nDoing what it takes to get the job done\nLeading with trust and vulnerability\nLeaving your ego at the door\nLearning from others\nElevating your peers\nTaking calculated risks\n\nWhat you’re willing to do:\nWork really hard\nInvest in yourself\nTake ownership of things\nCommit to our vision\nJump in and take action\nFix sh*t if it’s broken\nTest driven development\nMonitoring and evaluation\n\nWhat we’re about:\nGiving families around the world a helping hand\nMaking a difference\nModernizing how everyone views “Care”\n\nWhat we’re playing with:\nGo\nJava\nGraphQL\nReact JS\nNode\nMicro Services\nKubernetes\nKafka\ngRPC\n\n**Care.com supports diverse families and communities and seeks employees who are just as diverse. As an equal opportunity employer, Care.com recognizes the power of a diverse and inclusive workforce and encourages applications from individuals with varied experiences, perspectives, and backgrounds. Care.com is committed to providing reasonable accommodations for qualified individuals with disabilities. If you need assistance or an accommodation, please reach out to career.de@care.com**\n____________________________________________________________________________________________________________________________\nCompany Overview:\nAvailable in more than 20 countries, Care.com is the world's leading platform for finding and managing high-quality family care. Care.com is designed to meet the evolving needs of today's families and caregivers, offering everything from household tax and payroll services and customized corporate benefits packages covering the care needs of working families, to innovating new ways for caregivers to be paid and obtain professional benefits. Since 2007, families have relied on Care.com's industry-leading products—from child and elder care to pet care and home care. Care.com is an IAC company (NASDAQ: IAC).",
    "title": "Software Engineers, Multiple Levels (m/f/d)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQG5DLfub3jQ-w/company-logo_100_100/0/1625143332877?e=1640217600&v=beta&t=Tdz2EBFNQCmXM8jlTvII6d_rFcRO1s42lem0avLlGi0",
    "link": "https://www.linkedin.com/jobs/view/2708071887/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=%2FPSDG3JWCCR5IUg1icBeEg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "About Care.com \nCare.com is a consumer tech company with heart. We’re on a mission to tackle a human challenge we all face: finding great care for the ones we love. We’re moms and dads and pet parents. We have parents and grandparents, so we understand that everyone, at some point in their lives, could use a helping hand. Our culture and our products reflect that.\n\nHere, entrepreneurs, self-starters, teammates, and big thinkers unite behind a common cause. Here, we’re applying data analytics, AI and the latest technologies to solve universal problems and connect people in new ways. If you like having autonomy, if you thrive with collaboration and building new things, and if you’re all about using your talent for good, Care.com is the place for you. We are searching for Software Engineer l, II, Senior, Principal, and Architect Level Engineers!\n\nWhat you believe in:\nDoing what it takes to get the job done\nLeading with trust and vulnerability\nLeaving your ego at the door\nLearning from others\nElevating your peers\nTaking calculated risks\n\nWhat you’re willing to do:\nWork really hard\nInvest in yourself\nTake ownership of things\nCommit to our vision\nJump in and take action\nFix sh*t if it’s broken\nTest driven development\nMonitoring and evaluation\n\nWhat we’re about:\nGiving families around the world a helping hand\nMaking a difference\nModernizing how everyone views “Care”\n\nWhat we’re playing with:\nGo\nJava\nGraphQL\nReact JS\nNode\nMicro Services\nKubernetes\nKafka\ngRPC\n\n**Care.com supports diverse families and communities and seeks employees who are just as diverse. As an equal opportunity employer, Care.com recognizes the power of a diverse and inclusive workforce and encourages applications from individuals with varied experiences, perspectives, and backgrounds. Care.com is committed to providing reasonable accommodations for qualified individuals with disabilities. If you need assistance or an accommodation, please reach out to career.de@care.com**\n____________________________________________________________________________________________________________________________\nCompany Overview:\nAvailable in more than 20 countries, Care.com is the world's leading platform for finding and managing high-quality family care. Care.com is designed to meet the evolving needs of today's families and caregivers, offering everything from household tax and payroll services and customized corporate benefits packages covering the care needs of working families, to innovating new ways for caregivers to be paid and obtain professional benefits. Since 2007, families have relied on Care.com's industry-leading products—from child and elder care to pet care and home care. Care.com is an IAC company (NASDAQ: IAC).",
    "title": "Software Engineers, Multiple Levels (m/f/d)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQHrSjDgJ9muOQ/company-logo_100_100/0/1572989408724?e=1640217600&v=beta&t=w7wCt3ZGBLAs4vBfuDnL-OlfU7A0UWaSN7IbaUKgIig",
    "link": "https://www.linkedin.com/jobs/view/2720621023/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=vkoXVKdIMHqc2C2MtNDljg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Together, we can beat cancer.\n\nAt Varian, we bring together the world's best talent to realize our vision of a world without fear of cancer. Together, we work passionately to develop and deliver easy-to-use, efficient oncology solutions. If you want to be part of this important mission, we want to hear from you.\n\nTo support our Software Development Team in Munich, we’re looking for a full-time Software Engineer (m/w/d).\nDesigns and develops software for our patient identification and monitoring solutions in C++\nImplements software simulators and automated software tests\nMaintains and improves the software architecture for automated testing\nPerforms functional and performance tests and analyzes results\nEnsures that software meets or exceeds software code quality guidelines\nAuthors design specifications, software test specifications and protocols\nWorks together in a distributed team with software and quality engineers\nJob Requirements\nDegree in Computer Science, Engineering, or related discipline\nWorking experience in software engineering required\nProficient command in object-oriented programming, C++\nKnowledge of scripting languages like Python\nExperience with test frameworks\nGood understanding of Agile and Scrum processes\nPassion for solving problems and thinking outside the box\nWritten and spoken fluency in English\nFighting cancer calls for big ideas.\n\nWe envision a world without fear of cancer. Achieving this vision takes dedication and commitment from all of us, every single day. That's why we celebrate and value the distinctly beautiful and intersectional identities of each of our employees. We are a mirror of our patient-base, which allows us to innovate. Big ideas come from everywhere, and the best ideas are fostered by our unique individual experiences. At Varian, we encourage you to bring your whole self to work and believe your bold and authentic perspective will help to power more victories over cancer.\n\n#TogetherWeFight\n\nPrivacy Statement",
    "title": "Software Engineer (m/f/d) Applications"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQHkT9bP08FhfA/company-logo_100_100/0/1627906853654?e=1640217600&v=beta&t=jPpm6qfK113A24H30qtVBFOejky9eObBNHU2y6kRB3A",
    "link": "https://www.linkedin.com/jobs/view/2708894389/?alternateChannel=search&refId=pgzyDTkh3wr8wQ%2FhSKvXQA%3D%3D&trackingId=m2F8m5oPxStH5C8OYpCdew%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "At Bayer we’re visionaries, driven to solve the world’s toughest challenges and striving for a world where ,Health for all, Hunger for none’ is no longer a dream, but a real possibility. We’re doing it with energy, curiosity and sheer dedication, always learning from unique perspectives of those around us, expanding our thinking, growing our capabilities and redefining ‘impossible’. There are so many reasons to join us. If you’re hungry to build a varied and meaningful career in a community of brilliant and diverse minds to make a real difference, there’s only one choice.\n\nSoftware Engineer (m/f/d)\n\nWe in Bayer’s product platform research are seeking excellent full stack developers (m/f/d) driven by our mission “Health for all, hunger for none”. In our DevOps teams you can follow (y)our purpose and grow while working on tough challenges in a global pharma research setting. If you are passionate about creating cutting edge software together with scientists to help cure life-threatening diseases, we would love to hear from you. Your tasks in detail:\n\nYour Tasks And Responsibilities\nYou design, develop, and continuously deliver cutting edge software products in a fast-moving environment of the Pharma business\nYou perform hands-on full-stack software development based on cloud infrastructure\nYou take decisions to advance product development or team culture in a timely manner\nYou help identifying the most important problems to solve, minimize scope and assess the value of solutions\nYou apply your expertise in natural sciences in mixed teams consisting of IT and R&D experts (biologists/chemists/pharmacologists)\nYou develop and execute on a technical vision for evolvable systems\nYou identify risks and gaps in technical approaches and develop solutions to meet team and product goals\nYou help growing other engineers by leveraging technical knowledge and leadership skills as well as promote the principles behind DevOps and utilize DevOps practices to build and deploy high-quality software effectively and efficiently\nYou help scale DevOps capabilities in the organization\nWho You Are\nUniversity degree in computer science or equivalent natural science degree e.g. computational biology/chemistry\nYou have several years of professional experience in and expert-level knowledge of two or more modern programming languages and frameworks\nYou have proven and profound experience in principles behind agile, lean and continuous delivery approaches as well as hands-on experience with test-driven development (TDD) and infrastructure automation\nYou have a sound knowledge of cloud technology such as AWS or Docker\nYou have solid leadership skills and displayed entrepreneurial behavior in your daily work\nYou are resilient, able to deal with ambiguous situations and approach challenges from multiple perspectives\nFluent in English, both written and spoken, German is a plus\nYOUR APPLICATION\n\nThis is your opportunity to tackle the world’s biggest challenges with us: Maintaining our health, feeding growing populations and slowing the rate of climate change. You have a voice, ideas and perspectives and we want to hear them. Because our success begins with you. Be part of something big. Be Bayer.\n\nBayer welcomes applications from all individuals, regardless of race, national origin, gender, age, physical characteristics, social origin, disability, union membership, religion, family status, pregnancy, sexual orientation, gender identity, gender expression or any unlawful criterion under applicable law. We are committed to treating all applicants fairly and avoiding discrimination.\n\nLocation: Berlin, Wuppertal-Aprath\n\nDivision: Enabling Functions\n\nReference Code: 474257",
    "title": "Software Engineer (m/f/d)"
}]