[{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQF5jfJyLad3Vg/company-logo_100_100/0/1626297067145?e=1640822400&v=beta&t=4fofrbKD8tCorC9MxVGXB0iU3vNjgKgxypsdbxDhT2c",
    "link": "https://www.linkedin.com/jobs/view/2720010068/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=9XED9mBngNVXPoVeqfZr%2BA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Location(s)\n\nAlpharetta GA, Birmingham AL, Jacksonville FL\n\nDetails\n\nKemper is one of the nation’s leading specialized insurers. Our success is a direct reflection of the talented and diverse people who make a positive difference in the lives of our customers every day. We believe a high-performing culture, valuable opportunities for personal development and professional challenge, and a healthy work-life balance can be highly motivating and productive. Kemper’s products and services are making a real difference to our customers, who have unique and evolving needs. By joining our team, you are helping to provide an experience to our stakeholders that delivers on our promises.\n\nAt Kemper, the Systems Software Developer provides technical consulting for application software development or computing technologies within areas of expertise. Demonstrates a thorough knowledge of a specific programming language. Identifies and resolves\n\ncomplex technical problems and issues with assigned applications and work processes.\n\nPosition Responsibilities\nProvides technical consulting and support for application software development or computing technologies within areas of expertise.\nDevelops, documents and executes unit test cases.\nDelivers quality and timely results.\nIdentifies and resolves complex technical problems and issues with assigned applications and work processes. Escalates problems beyond level of expertise to manager, more experienced technical staff or vendor representatives.\nReview and recommend test plans for impacted areas and test coverage.\nComplies with and supports all corporate, department and team policies and procedures.\nKeeps manager, project teams/managers and business customers informed of activities and problems within assigned areas of responsibility; refers matters beyond limits of authority to manager for direction.\nRecommends improvements to existing processes or proposes new ones, to improve the quality of project deliverables.\nPerforms code and design reviews.\nConsults with internal and external customers on the utilization of applications computing technologies, within areas of expertise, to ensure that customers optimize the value of those technologies.\nLeads projects within specified technical disciplines; plans for the appropriate resources needed.\nDevelop technical knowledge and performance skills of IS projects teams, within areas of expertise.\nResearches, evaluates and recommends new technologies independently or with the architect’s implementation.\nSupports proof-of-concept activities\nDevelop technical specs, design documents, functional designs and requirements.\nPosition Qualifications\n5+ Years of Experience Bachelor's degree, equivalent work experience or appropriate technical certification.\nDemonstrates a thorough knowledge of a specific programming language.\nAbility to support multiple software applications\nAbility to code, unit test and debug complex business applications.\nAbility to write systems design specifications for complex applications\nAbility to quickly learn new/emerging technologies and resolve any problems involved in integrating these new/emerging technologies with our systems.\nAbility to manage own time and prioritize activities and resources to deliver timely results.\nAbility to gather and analyze complex facts and data and to draw correct inferences from the information. Assesses alternatives and presents logical solutions to problems.\nKnowledge of cloud development practices\nAbility to influence events to achieve results. Originates independent action rather than passively reacting to events as they occur.\nAble to follow industry defined best practice development standards.\nProfessional experience with frameworks and development tools\nExperience in executing and supporting testing.\nWorked with various project methodologies (agile and waterfall)\nAble to translate business to technical requirements.\nUnderstands technical controls, security concepts and SOX requirements.\nGood understanding of the insurance industry and company business practices preferred.\nAbility to address and analyze impact of system issues.\nAbility to create and maintain a positive customer service relationship and to identify and understand customers' needs. Maintains two-way communication to deliver products and services that meets customer expectations.\nKemper is proud to be an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, disability status or any other status protected by the laws or regulations in the locations where we operate. We are committed to supporting diversity and equality across our organization and we work diligently to maintain a workplace free from discrimination.\n\nKemper does not accept unsolicited resumes through or from search firms or staffing agencies. All unsolicited resumes will be considered the property of Kemper and Kemper will not be obligated to pay a placement fee.\nZR -GD -IN -PT",
    "title": "Systems Software Developer (Java)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQEx4NIXNQDjhQ/company-logo_100_100/0/1627578641769?e=1640822400&v=beta&t=f1qnoSa2jgH871bXBW2ZzCuCIK7uHn7jV1sq7AhA0Us",
    "link": "https://www.linkedin.com/jobs/view/2726163164/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=vwk96Lj7MBffH62O2WMN5g%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Department: None\nDescription\n\n\nIf you are a Software Developer looking for an opportunity to grow, Emerson has an exciting opportunity for you! This position can be based in either our St. Louis, MO or Baton Rouge, Louisiana location.  You would become a member of the Agile team responsible for the development of AgileOps and Interface  Dynamics. \n\nSuccessful applicants would be expected to enhance and maintain existing products as well as develop the next generation of features of AgileOps and Interface Dynamics. This candidate's focus will primarily be applications and HMI development in Microsoft Windows environment using C# and ASP.NET, with the the opportunity to learn and work on other parts of the platform.\n\nAS A SOFTWARE DEVELOPER, YOU WILL:\nGenerate software designs in accordance with marketing, architecture and human-centered design requirements and specifications\nUse best practices to build high-quality software that meets our stringent definition of done for an Agile increment\nHelp the team continuously improve its environment and processes\nParticipate in Agile activities like sprint planning, retrospectives, and program increment planning\nCollaborate with the team’s product owner to integrate new features\nDebug and validate software issues with unreleased and released software, including customer issues\nDevelop estimates and effectively communicate status to the team\nWrite acceptance tests\n\n\nWHO YOU ARE:\n\nYou stay on top of new technologies. You manage uncertainty with confidence. You engage in collaborative planning. You take time to ask questions and define the problem. You make learning a priority and a goal.\n\n\nREQUIRED EDUCATION, EXPERIENCE & SKILLS:\nBachelor’s degree in Computer Science, Computer Engineering or related engineering field \nExperience with Windows application and/or HMI development in C#\nExperience using object-oriented design techniques\nExcellent verbal and written communication skills\nAbility to effectively collaborate in an Agile team environment with disciplined development practices\nExperience with Microsoft development tools and an understanding of the Windows operating system\n\n\nPREFERRED EDUCATION, EXPERIENCE & SKILLS:\nBachelor’s degree in Computer Science, Computer Engineering or related engineering field and 4+ years of related experience, OR a Master’s degree in Computer Science, Computer Engineering or related engineering field and 3+ year of related experience\nExperience working in an Agile Team\nExperience with software testing, including test-driven development and automation\nExperience with ASP.NET, JavaScript, TypeScript, DCOM, WCF, SQL\nKnowledge and experience working in the process control industry\nTechnical expertise with Control Systems\n\n\n\n\nWHY EMERSON?\n\nOur Commitment to Our People\n\nWe invest in our employees to ensure they have the marketplace knowledge, skills and competencies to compete and lead in a global economy. Our training programs focus on end-to-end development from onboarding through senior leadership.\n\nFlexible and competitive benefits plans offer you the right options to meet your individual/family needs:  medical insurance plans, dental and vision coverage, 401(k), tuition reimbursement, and more.  We provide employees flexible time off plans including paid parental leave (maternal and paternal), vacation and holiday leave.\n\nOur success is measured by the positive impact we make on people, our communities and the world in which we live.  Learn more about us! .\n\nOur Commitment to Diversity & Inclusion\n\nAt Emerson, we are committed to fostering a culture where every employee is valued and respected for their experiences and perspectives. We believe a diverse and inclusive work environment contributes to the rich exchange of ideas that inspires innovation and brings the best solutions to our customers. This philosophy is fundamental to living our company’s values and our responsibility to leave the world in a better place.\n\nDiversity and Inclusion at Emerson is about welcoming, respecting, and valuing the differences each employee possesses. Inclusion is creating a real sense of engagement, belonging and connection for all employees. Learn more about our Culture & Values  and about  Diversity & Inclusion at Emerson .\n\nWork Authorization\n\nNo calls or agencies please. Emerson will only employ those who are legally authorized to work in the United States. This is not a position for which sponsorship will be provided. Individuals with temporary visas such as E, F-1, H-1, H-2, L, B, J, or TN or who need sponsorship for work authorization now or in the future, are not eligible for hire.\n\nEqual Opportunity Employer\n\nEmerson is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, national origin, age, marital status, political affiliation, sexual orientation, gender identity, genetic information, disability or protected veteran status. We are committed to providing a workplace free of any discrimination or harassment.\n\nIf you have a disability and are having difficulty accessing or using this website to apply for a position, you can request help by sending an email to  idisability.administrator@emerson.com .  \n\n\nPrimary Location\n\nUnited States-Missouri-St. Louis\n\nOther Locations\n\nUnited States-Louisiana-Baton Rouge\n\nJob Function\n\nSoftware Development\n\nDate\n\nSep 23, 2021, 10:21:47 PM",
    "title": "Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQEijlLJj3Sp6w/company-logo_100_100/0/1625141800434?e=1640822400&v=beta&t=ffWFFk9W0N-24BpZ9DVXH1g7053y7PFizlCDpsZUaK0",
    "link": "https://www.linkedin.com/jobs/view/2736274735/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=QFxfpvAfoUpgIN18yoCGKA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description\n\nThe Software Developer is responsible for working closely with stake holders, product owners, and agile team members to understand and communicate business requirements that drive the analysis and design of quality technical solutions. The software developer II will build defined features, write tests, identify issues, fix bugs and fully participate in the agile process. The software developer II will develop a level of understanding over a significant portion of company applications.\n\nResponsibilities\nWorks closely with stake holders, product owners, and agile team members to understand and communicate the business requirements that drive the analysis, design and development of quality technical solutions.\nThese solutions must be aligned with business and IT strategies and comply with the organization’s architectural standards.\nDevelops and participates in making recommendations towards the design and development of application architecture, business systems, and development of IT solutions across a limited number of disciplines and functional areas.\nCollaborates effectively with others in a variety of work settings. This involves helping to educate others on their area of work, understanding the issues and concerns of other areas, and working together to solve problems.\nFully participates in the system development life cycle of the company’s software solutions. Is expected to assist with the analysis and design recommendations. Will participate in the coding, testing and implementation efforts.\nDocuments and communicates project/task progress with their agile team.\nIs expected to complete task in timely manner.\nKnowledge And Skills\nExperience in and a solid understanding of design, development, quality assurance and integration methodologies.\nDemonstrates proficiency and proven expertise in at least one skill and/or discipline.\nHave a good understanding of and ability to analyze client needs and supplies comprehensive solutions to meet those needs\nEducation And Experience\nBachelor’s degree in Computer Science, Information Systems, or related field.\nDegree from a Technical school or equivalent work experience.\nOn the job training is also recognized.\n3-5 years of related experience.\nDevelopment experience in languages and technologies used by the company.\nAn intermediate level understanding of the Insurance business.\nWork experience in Property Casualty or Specialty Insurance a plus.\nJob Number\n\n1505BR\n\nDivision\n\nCorporate - IT\n\nLocation\n\nCanton MA\n\nLocation(s)\n\nCanton MA\n\nCountry\n\nUnited States\n\nAbout Us\n\nThroughout the United States, Intact Insurance Specialty Solutions’ underwriting companies offer a broad range of specialty insurance products through independent agencies, regional and national brokers, wholesalers and managing general agencies. Each business is managed by an experienced team of specialty insurance professionals focused on a specific customer group or industry segment, and providing distinct products and tailored coverages and services. Targeted solutions include group accident and health; commercial and contract surety; entertainment; environmental; excess property; financial institutions; financial services; inland marine; management liability; ocean marine; public entities; technology; and tuition refund. For further information about U.S. products and services visit: intactspecialty.com.",
    "title": "Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQGWOQyVqNPLTw/company-logo_100_100/0/1617649673317?e=1640822400&v=beta&t=QvlNiX29F7Ips_ZPevGBfSw3rwOwpSJ1yfBSXvLBVLc",
    "link": "https://www.linkedin.com/jobs/view/2730567270/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=h6lLbhYYPqNlh1bYWY3kdA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "DevRev\n\nDevRev is ushering in the era of Developer Customer Relationship Management. The foundation of this new category is an end-to-end platform for developers to build products, support end users, and grow their businesses in a product-led era of all things code. The outcome will bring Developers closer to Revenue and increase developer productivity by humanizing software development with the use of design, data engineering, and machine intelligence (AI/ML).\n\nDevRev is a company for developers built by developers. We at DevRev believe that to efficiently connect developers to customers, we must harness the knowledge of engineers to build a knowledge-centric system, making enterprise software more product- and customer-centric.\n\nAfter former Nutanix CEO Dheeraj Pandey and Nutanix executive Manoj Agarwal raised one of the largest ever seed rounds in the history of Silicon Valley, they set out to create a highly engaging system of record that promises to make product development and customer service joyous. DevRev is solving a difficult AI and design problem, and the early employees are committed to the marathon of company-building and hard problem-solving.\n\nJob Description\n\nWe are looking for ambitious and authentic software developers who can bring a fresh perspective to solving challenging problems and build infrastructure that will support AI/ML applications and a delightful user experience. A good grasp of operating systems, distributed systems, databases, and networking concepts and the ability to design for scale, optimized memory usage, and performance are required to be successful in this role.  As a software developer at DevRev, you will have the opportunity to build things that truly matter and to work with a thriving global team.\n Minimum qualifications:\n Bachelor's or Master’s degree in Computer Science or related technical field\nSoftware development experience coding in C, C++, Java, Golang\nStrong experience with memory and performance optimization\nAgile development processes theoretical and practical knowledge and experience\nCreative problem solving\n Preferred qualifications:\n 5+ years of experience programming with two or more of the following languages: C, C++, Java, Golang, or Python\nExperience with implementation and development of microservices-based scalable architecture\nExperience with Cloud development technologies such as AWS Lambda, SQS, Dynamodb, etc.\nExperience with building and operating large scale systems in multi-tenant environments\n\nCulture\n\nThe foundation of DevRev is its culture -- our commitment to those who are hungry, humble, honest, and who act with heart. Our vision is to help build the earth’s most customer-centric companies. Our mission is to leverage design, data engineering, and machine intelligence to empower engineers to embrace their customers. That is DevRev!",
    "title": "Software Developer: Systems"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQG654s6v4RHWw/company-logo_100_100/0/1519861653231?e=1640822400&v=beta&t=jOrXQzYNIrHVeMoK8IBuaB993jjXpLmQPjiXBDK5_II",
    "link": "https://www.linkedin.com/jobs/view/2730567270/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=h6lLbhYYPqNlh1bYWY3kdA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Posted by\nMatt Schrimpf\nBuilder at DevRev\nDevRev\n\nDevRev is ushering in the era of Developer Customer Relationship Management. The foundation of this new category is an end-to-end platform for developers to build products, support end users, and grow their businesses in a product-led era of all things code. The outcome will bring Developers closer to Revenue and increase developer productivity by humanizing software development with the use of design, data engineering, and machine intelligence (AI/ML).\n\nDevRev is a company for developers built by developers. We at DevRev believe that to efficiently connect developers to customers, we must harness the knowledge of engineers to build a knowledge-centric system, making enterprise software more product- and customer-centric.\n\nAfter former Nutanix CEO Dheeraj Pandey and Nutanix executive Manoj Agarwal raised one of the largest ever seed rounds in the history of Silicon Valley, they set out to create a highly engaging system of record that promises to make product development and customer service joyous. DevRev is solving a difficult AI and design problem, and the early employees are committed to the marathon of company-building and hard problem-solving.\n\nJob Description\n\nWe are looking for ambitious and authentic software developers who can bring a fresh perspective to solving challenging problems and build infrastructure that will support AI/ML applications and a delightful user experience. A good grasp of operating systems, distributed systems, databases, and networking concepts and the ability to design for scale, optimized memory usage, and performance are required to be successful in this role.  As a software developer at DevRev, you will have the opportunity to build things that truly matter and to work with a thriving global team.\n Minimum qualifications:\n Bachelor's or Master’s degree in Computer Science or related technical field\nSoftware development experience coding in C, C++, Java, Golang\nStrong experience with memory and performance optimization\nAgile development processes theoretical and practical knowledge and experience\nCreative problem solving\n Preferred qualifications:\n 5+ years of experience programming with two or more of the following languages: C, C++, Java, Golang, or Python\nExperience with implementation and development of microservices-based scalable architecture\nExperience with Cloud development technologies such as AWS Lambda, SQS, Dynamodb, etc.\nExperience with building and operating large scale systems in multi-tenant environments\n\nCulture\n\nThe foundation of DevRev is its culture -- our commitment to those who are hungry, humble, honest, and who act with heart. Our vision is to help build the earth’s most customer-centric companies. Our mission is to leverage design, data engineering, and machine intelligence to empower engineers to embrace their customers. That is DevRev!",
    "title": "Software Developer: Systems"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQEVScXlyawi3Q/company-logo_100_100/0/1519907477754?e=1640822400&v=beta&t=6ZEJlFVVk_D-7IISnH0Vvfcf0BQFVCNKygEQi82jQHc",
    "link": "https://www.linkedin.com/jobs/view/2736205976/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=FIXZjxFK2lFWyogKZVs%2BXw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Our client, a successful, highly profitable, and rapidly growing 100MM Technology Company HQ'd in Austin is hiring a Junior Software Engineer located in or willing to relocate to Austin, TX. This is a great opportunity for a new or recent grad to work directly with the Founder and Chief Architect in a role that will see you designing technical blueprints, proof of concepts, and data-driven experiments that will have a very large impact on the company's revenue.\nWe are not looking for experience in any specific tech stack however in this role you will gain exposure to JavaScript (React, Angular, etc.), HTML, CSS, and PHP. You'll also work with SQL / Scala from a data perspective. \nRequired Qualifications:\nBachelor’s Degree or higher degree in Math or Computer Science from UT Austin or another top 25 University in the US (or top 50 School worldwide)\nBenefits\nHighly competitive salary \nCompany-paid gym membership \nComprehensive, company-paid health, vision, and dental insurance premiums for you and your dependents \n401(k) retirement plan with 3% employer contribution (whether you contribute or not)\nPaid company holidays & Unlimited PTO\nPaid Parental/Adoption Leave \nAwesome company events ",
    "title": "Junior Software Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQFJ2dl1EgcEFA/company-logo_100_100/0/1525118780499?e=1640822400&v=beta&t=JClBAE0HrQmGA-BpJva-0s2KwSOSrUBgCopdpM6y2HA",
    "link": "https://www.linkedin.com/jobs/view/2731099061/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=TrZddCDlS%2FM548tYZTGkmQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "What We Offer\n\nAre you a passionate, talented software junky ready to tackle some of the largest supply chain challenges in the world. Are you looking to join a world class team that creates innovative software solutions to get products to your front door at blazing speed. If so, we’re looking for you. As a software engineer at Dematic, you will tackle some of the most challenging and rewarding logistics projects in the world. You will work alongside other best-in-class professionals to implement large, complex integrated business solutions for some of the world’s leading brands. Sound like you. Come join us and get ready to make a difference.\n\nCareer Development\n\nWe are here to support you for the entirety of your Dematic career. From a fast start of learning Dematic’s history and foundational training to succeed in your role to leadership development programs, technical training and certifications, and Career Navigator to identify challenging new opportunities, our goal is to help you grow beyond your borders.\n\nCompetitive Compensation And Benefits\n\nOur attractive and market competitive total rewards packages are designed to reward high performance and to assist in managing your personal and family needs. Dematic offers robust packages based on employment status and national requirements.\n\nPay Transparency\n\nDematic is committed to pay transparency. As such, Dematic will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant.\n\nHowever, Dematic will still maintain confidentiality of your pay information. Employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by Dematic, or (c) consistent with Dematic’s legal duty to furnish information.\n\nGlobal Opportunities\n\nAs a global company, our employees are exposed to different ideas and perspectives from around the world. We offer international assignments for qualified employees and wherever possible, we offer flexible working hours and modern workspace design.\n\nLearn More Here: https://www.dematic.com/en-us/about/careers/what-we-offer/\n\nTasks And Qualifications\nTalent to create elegant solutions for some of the most complex material handling and logistics projects in the world\nDeliver large, impactful, and meaningful enterprise projects while working in a small, nimble, and flexible start-up environment\nDevelop high-quality code and unit tests - we love testing!\nCollaborate with highly cross-functional, Agile teams to build out new customer features and functionality\nImprove internal processes to make code deployment easier, faster and more consistent\nPlay a critical role in system design, architecture, and execution\nTravel across North America to customer sites to validate system functionality and testing (approximately 20%)\nTechnologies we use\nJava EE\nWildfly\nMSSQL / Oracle\nGWT\nPython\nGitHub\nQualifications\nBachelor's degree in Computer Science, Computer Engineering, or Software Engineering or related field\nExperience with multiple object-oriented languages and operations systems to create software using industry best practices, tools, and methods\nPassion for problem solving and executing with excellence\nBenefits and perks\nFlexible work environment\nFull medical, dental, and vision\n401k with match\nGenerous PTO and vacation\nExciting opportunities for personal and professional growth",
    "title": "Java Software Developer - DiQ Optimize"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQH8CI9sHV5ZWA/company-logo_100_100/0/1625117356787?e=1640822400&v=beta&t=XbHdcSiaQnG5n2SvRZBmPvU9YX828HcX2J8X_dYBW6I",
    "link": "https://www.linkedin.com/jobs/view/2723816842/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=ytLViEY3UolDmXydj2sMxQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Revature is the fastest growing employer of emerging technology talent in the US. We will hire over 300 new Junior Software Developers in the next 4 weeks.\n\nOne day someone is going to ask you where you got your start…This is IT!\n\nWith a wide range of Fortune 500 enterprises, government organizations and top systems integrators as our clients, we not only provide you with the skills needed to succeed through an employer-paid training program but will also give you the opportunity to put those skills to use, on projects that matter.\n\nWhat We Are Looking For\nCollege degree (Associates or Bachelors)\nMust be authorized to work in the US\nStrong desire to learn to code - No prior professional experience required.\nA natural problem solver\nStrong communication and interpersonal skills\nWilling to relocate anywhere in the US - Relocation assistance provided\nWhat We Offer\nCompetitive salary\nRelocation & housing assistance\nHealth, vision & dental insurance\nPaid time off\nIndustry Certifications\nLife Insurance Policy\n401k\nMentoring program and ongoing support throughout your entire Revature career\nExperience with the largest and most reputable companies in the US\nApply Today. Interviews are going on now.\n\n#SoftwareEngineering\n\nEqual Employment Opportunity\n\nThe Company is an equal opportunity employer. We will extend equal opportunity to all individuals without regard to race, religion, color, sex, pregnancy, childbirth or related medical conditions, sexual orientation, gender identity, national origin, disability, age, genetic information, marital status, veteran status, or any other status protected under applicable federal, state, or local laws. This policy applies to all terms and conditions of employment, including but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, benefits, compensation and training. If you require an accommodation to work based on any of these protected factors, please notify the Human Resources Department, and the Company will evaluate the request and provide an accommodation in accordance with applicable law.\n\nWe seek to comply with all applicable federal, state and local laws related to discrimination and will not tolerate the interference with the ability of any of the Company’s employees to perform their job duties. Our policy reflects and affirms the Company’s commitment to the principles of fair employment and the elimination of all discriminatory practices.",
    "title": "Junior Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQGmS4ZS9i2T6w/company-logo_100_100/0/1568109893443?e=1640822400&v=beta&t=RBmXuX5VlheFlLjVQ9H-ubslrGjQfTDcZD4YgAP9YUQ",
    "link": "https://www.linkedin.com/jobs/view/2737400848/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=HgKVsd6bHAUOST89VEH%2BCw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Job Description\n\nAre you passionate about building great services and tools for software developers? If this is you, Oracle Cloud Infrastructure (OCI) can provide you the opportunity to build and operate a suite of massive scale, integrated cloud services in a broadly distributed, multi-tenant cloud environment.\n\nWe are the developer experience team. Our mission is to give our customers the best-in-class tools and services to build and manage their Oracle cloud infrastructure. We are continuously building new features and products. We are building RQS, Dashboards, preferences services to improve our customer experience. This is an exciting project with design, architecture, development and operations opportunities. Broadly, we are looking for hands-on engineers with expertise and passion in building the back end, front end and tools for our public cloud infrastructure.\n\nAs a Software Engineer, you will work with a team of software engineers responsible for the software design, development and operations for our new and existing products. You should be be able to architect broad systems interactions, be hands-on, be able to dive deep into any part of the stack, and have a good sense of developer experience. You should value simplicity and impact, work comfortably in a collaborative, agile environment, and be excited to learn.\n\nWe are looking to enhance our console services to improve our customer experience.\n\nStrong experience in distributed systems with keen eye on reliability, scalability and performance are what we look in our candidates to succeed in this role. Our senior engineers are also the people who can work independently and provide technical leadership to the organization. You should have experience developing and operating high-scale services, and understanding of how to make these cloud-scale services resilient. The ideal candidate will be technically strong and productive; someone who knows how to balance speed and quality with iterative and incremental improvements. You understand operational excellence and know how to infuse a culture of being proactive within your team. You recommend and justify major changes to existing products and establish consensus with data-driven approaches.\n\nBasic Qualifications: - 2+ years of experience with full-stack development experience\nProficient at high level programming languages such as Java, C#, Python, etc.\nAbility to deliver products from the ground up going through a product life cycle\nExperienced with microservice design patterns and service-to-service communication protocols along with developing highly reliable services.\nBachelors in Computer Science and engineering or related engineering fields Preferred Qualifications: - Prior development experience with Eclipse or Intellij.\nPrior Hands-on experience developing cloud services and tools on Oracle Cloud/AWS/GCP/Azure\nExperience with Javascript/Typescript programming language.\nBachelors/ Masters degree in Computer Science\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will apply basic to intermediate knowledge of software architecture to perform software development tasks associated with developing, debugging or designing software applications or operating systems according to provided design specifications. Build enhancements within an existing software architecture and occasionally suggest improvements to the architecture.\n\nDuties and tasks are standard with some variation; displays understanding of roles, processes and procedures. Performs moderately complex problem solving with assistance and guidance in understanding and applying company policies and processes. BS degree or equivalent experience relevant to functional area. 1 year of software engineering or related experience.\n\nAbout Us\n\nInnovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer.\n\nOracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
    "title": "Software Developer 2"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQGyRzbB8_BYkg/company-logo_100_100/0/1561988236856?e=1640822400&v=beta&t=-0G32Z_92JH47i37Ee3APi06-ays2t4wiluyNHV-kCA",
    "link": "https://www.linkedin.com/jobs/view/2730501316/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=NIftFNjyujshawWHkrZfGA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "About This Role\n\nGartner is seeking a well-rounded and motivated full stack Software Developer who will be a part of the team, developing and supporting Gartner Client engagement applications. Gartner’s Engagement Center of Excellence is responsible for all client facing applications across web and mobile channels that is the primary means of delivering insights to our clients on their mission critical priorities.\n\nWhat You Will Do\nThe ideal candidates should have strong hands-on software development experience with OO languages (Java/Go/Python) and JavaScript, HTML, CSS web-based technologies, to contribute to agile development practices and must have been involved in all phases of the software development life cycle.\nUnderstands Gartner’s domain, business model and works with business stakeholders to achieve objectives and goals by contributing to the development world class client portal.\nBuilds web applications – translates requirements and designs into working software, follows coding standards, builds appropriate unit tests & integration tests and follows security and performance best practices.\nCollaborates with leads to explore existing systems, determines areas of complexity, potential risks to successful implementation, learns the applications capabilities\nOwns success – Takes responsibility for successful delivery of the solutions.\nContributes to continual improvement by suggesting improvements to user interface and applying latest technologies\nAbility to work independently or within a team, proactively, in a fast-paced Agile-SCRUM environment.\nWhat You Will Need\nUniversity degree in Bachelor of Engineering or a Master’s degree in CS with 2-3 years of experience in software development.\nMust have full stack experience in developing web applications using Java, Spring/Struts, XML, HTML, CSS and Javascript.\nMust have strong Web UI knowledge and best practice skills, with experience in one or more frontend frameworks. (React/Redux/Angular/Material-UI/Bootstrap).\nMust have experience with relational databases (like Oracle/MySQL) with strong SQL skills, any NoSQL experience is a plus.\nKnowledgeable in using development tools, testing frameworks, servlet containers and techniques (Maven, JIRA, GIT/SVN, Bamboo/Jenkins, Selenium, JMeter, Tomcat, XP/TDD).\nAbility to solve cross browser issues and understands web accessibility standards\nExperience developing responsive web sites desirable.\nExcellent verbal and written communication skills.\nMust be able to provide accurate estimates of technology work and deliver high quality work on schedule\nStrong desire to improve upon their skills in software development, frameworks and technologies\nWho You Are\nMotivated, high-potential performer, with demonstrated ability to influence and lead.\nStrong communicator with excellent interpersonal skills.\nAble to solve complex problems and successfully manage ambiguity and unexpected change.\nTeachable and embracing of best practices and feedback as a means of continuous improvement.\nConsistently high achiever marked by perseverance, humility and a positive outlook in the face of challenges.\nWho are we?\n\nGartner delivers actionable, objective insight to executives and their teams. Our expert guidance and tools enable faster, smarter decisions and stronger performance on an organization’s most critical priorities. We’ve grown exponentially since our founding in 1979 and we're proud to have nearly 16,000 associates globally that support our 14,000+ clients in more than 100 countries .\n\nWhat makes Gartner a great place to work?\n\nOur teams are composed of individuals from different geographies, cultures, religions, ethnicities, races, genders, sexual orientations, abilities and generations. We believe that a variety of experiences makes us stronger—as individuals, as communities and as an organization. That’s why we're recognized worldwide as a great place to work year after year. We've been recognized by Fortune as one of the World’s Most Admired Companies, named a Best Place to Work for LGBTQ Equality by the Human Rights Campaign Corporate Equality Index and a Best Place to Work for Disability Inclusion by the Disability Equality Index. Looking for a place to turn your big ideas into reality? Join #LifeAtGartner\n\nWhat We Offer\n\nOur people are our most valuable asset, so we invest in them from Day 1. When you join our team, you’ll have access to a vast array of benefits to help you live your life well. These resources are designed to support your physical, financial and emotional well-being. We encourage continued personal and professional growth through ongoing learning and development opportunities. Our employee resource groups, charity match and volunteer programs keep you connected to your internal Gartner community and causes that matter to you.\n\nThe policy of Gartner is to provide equal employment opportunities to all applicants and employees without regard to race, color, creed, religion, sex, sexual orientation, gender identity, marital status, citizenship status, age, national origin, ancestry, disability, veteran status, or any other legally protected status and to affirmatively seek to advance the principles of equal employment opportunity.\n\nGartner is committed to being an Equal Opportunity Employer and offers opportunities to all job seekers, including job seekers with disabilities. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request reasonable accommodations by calling Human Resources at 203-964-0096 or by sending an email to ApplicantAccommodations@gartner.com .\n\nJob Requisition ID:59147\n\nBy submitting your information and application, you confirm that you have read and agree to the country or regional recruitment notice linked below applicable to your place of residence.\n\nGartner Applicant Privacy Link: https://jobs.gartner.com/applicant-privacy-policy\n\nFor efficient navigation through the application, please only use the back button within the application, not the back arrow within your browser.",
    "title": "Full Stack Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQETQmdRQE_7Dw/company-logo_100_100/0/1531138204020?e=1640822400&v=beta&t=eT2SDunaS0C78KEsfC86NsnSLBvhR9js7sg_47Y01B0",
    "link": "https://www.linkedin.com/jobs/view/2720618443/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=%2FBd%2BumL44cUyJ75AG2CruQ%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Requisition ID: 50542\n\nTitle: Associate Software Developer\n\nDivision: Arthrex, Inc. (US01)\n\nLocation: Naples, FL.\n\nMain Objective: Assist with the development of reliable software applications that support Arthrex’s mission of helping surgeons treat their patients better by writing reliable code and collaborating in a cross-functional team environment.\n\nEssential Duties And Responsibilities\nAssists in software application development. Takes clearly defined requirements and instructions to meet intended objectives and key results.\nMaintains and enhances existing applications. Effectively diagnoses and resolves application issues.\nAssists with all aspects of the technology stack from client side programming to configuring servers and running applications.\nMonitors applications for abnormalities and looks for areas to improve application availability and speed.\nWorks effectively with the UX, QA and Product Management teams during all stages of application development (ideation, design, build, test, and release).\nOccasional travel for training, meetings or trade shows may be required.\nIncidental Duties\n\nThe above statements describe the general nature and level of work being performed in this job. They are not intended to be an exhaustive list of all duties, and indeed additional responsibilities may be assigned, as required, by management.\n\nEducation And Experience\n\nHigh school diploma or equivalent required.\n\nAssociate’s/Bachelor’s degree in computer science or related field preferred.\n\nAt least 1 year of hands-on experience developing web/mobile applications, some experience or formal training with scripting languages and databases required.\n\nKnowledge And Skill Requirements/Specialized Courses And/or Training\nExperience developing and supporting web and/or mobile applications using programming/scripting languages such as Ruby, Objective-C, Go, Python or Java.\nExperience developing applications using a framework such as Ruby on Rails or MVC on iOS a plus.\nUnderstanding of modern web development including JavaScript, responsive web design and front end frameworks such as React and AngularJS a plus.\niOS, Swift, Objective-C, and UIKit development skills are a plus.\nAndroid and Java development skills are a plus.\nBasic understanding of good relational database design.\nBasic knowledge about web standards, W3C specifications and cross-browser/cross-platform/cross-device compatibility are a plus.\nExperience with distributed version control systems such as Git a plus.\nAbility to work effectively with little supervision and strong attention to detail in a team environment.\nIndividual must be highly motivated and self-directed.\nExcellent written and verbal communication skills.\nKnowledge of or willingness to learn Ruby, Objective C, Go, Swift, Java, or any language/technology required by the project.\nMachine, Tools, And/or Equipment Skills\n\nExperience working with code editors and team collaboration software. Individual must feel comfortable using the command line. Experience with Mac OS X is a plus.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.",
    "title": "Associate Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQFojEPTQ56_Sw/company-logo_100_100/0/1565303594302?e=1640822400&v=beta&t=2WBGXR-9SWO0UyETtuHyJhc5HaNgG-C6xu8rg6AUl4A",
    "link": "https://www.linkedin.com/jobs/view/2732796630/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=Kb9psgZQHnFigo9LrM9LLA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "About ENFOS:\n\nWe’re a growing software company that operates in the rapidly expanding environmental industry. Our customers are some of the most massive corporations in the world (ENFOS.com/customers) but our small team size allows your opinion to make a big impact – and we welcome big voices. ENFOS is full of passionate people who leverage technology to do great work for the Earth. We’re different and we stand out as unique in our field. We solve complex problems with the simple goal of helping our customers clean up the world.\n\nThis is a full-time position and includes: pre-IPO stock options, building your own workstation on the company’s dime, generous medical benefits, and very flexible weeks of paid vacation. \n\nCOVID Situation: We are looking for someone based in the Raleigh-Durham area. For the next few months, the job will be remote. Once we open our NC office, we'll stay flexible but aim for being in the office three days a week when the situation is safe. Currently, all our staff (including this role) are indefinitely working from home.   \n\nOur office culture aims to be relaxed so that we can give all our devs a low-stress environment to work their best. We look for self-motivated, self-starter personalities who can independently craft successes out of the freedom provided. If you're a fan of any of the following: open-source projects, Dungeons & Dragons, Reddit, nature hikes, fantasy novels, football, foreign languages, video games or cute dogs – you’re already guaranteed to have some friends with common interests at ENFOS.\n\nIf you’re looking to escape a world of bureaucratic formality but don’t want to put the financial stability of your life on the line in a fresh startup company, ENFOS could be the new home for your skills. We have customers using our platform in every continent of the world; we have taken 0 professional funding; we are self-owned; and we operate successfully on our own revenue.\n\nwww.ENFOS.com\n\nWhat responsibilities you can expect:\n\nYou’ll be training to work in a small team on tasks that are constantly changing. We will expect you to have a personal interest in writing clean and modular code. You’ll be working to improve our solutions in Java EE and also structuring and building UI screens. You’ll be delving into our databases and SQL functions. You’ll be contributing to technical designs and working to develop new features for our customers. Maybe you’ll start surprising us with improvements we didn’t even think about yet.\n\nRequirements:\n\nWorking knowledge of Java & SQL\nA (demonstrable) history of passion for challenges\nComplete willingness to train and learn new things\nExcellent communication skills\nOutstanding analytical skills\n\nBenefits:\nGenerous Paid Time Off (Vacation, Sick & Public Holidays)\nFull Family Health Care Plan\nFamily Leave (Maternity, Paternity)\nRetirement Plan (401k)\nPre-IPO Stock Options\n\n\nSecret tip: If you want to stand out to us, specifically show how you meet the elements above. You could even make a list on your cover letter and address them one by one. Seriously. Do It. It’ll make me smile.",
    "title": "Software Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQFwn8CHaum_AA/company-logo_100_100/0/1519856123566?e=1640822400&v=beta&t=NtY7NFAAQv3s-KXieYfcCiLjWppVkKNLHK5AoGmaE8s",
    "link": "https://www.linkedin.com/jobs/view/2730417227/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=7Rg7UD6gKrE9ZyTzFnVWBw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Ethicon’s Advanced Imaging business is recruiting for a Software Engineer, R&D located in Cincinnati, OH!\n\nJohnson & Johnson Medical Devices is focused on shaping the future of digital surgery and expanding its robotics and digital solutions offerings across the entire portfolio, with multi-specialty, end-to-end solutions in orthopedics, endoluminal intervention and general surgery. This includes the MONARCH® platform, a first-of-its-kind robotic technology indicated for bronchoscopic visualization of and access to patient airways for diagnostic and therapeutic procedures in the lung.\n\nEthicon, part of Johnson & Johnson Medical Devices Companies, has made significant contributions to surgery for more than 100 years from creating the first sutures, to revolutionizing surgery with minimally invasive procedures. Our continuing dedication to Shape the Future of Surgery is built on our commitment to help address the world's most pressing health care issues and improve and save more lives. Through Ethicon's surgical technologies and solutions including sutures, staplers, energy devices, trocars and hemostats and our commitment to treat serious medical conditions like obesity worldwide, we deliver innovation to make a life-changing impact. For more information, visit www.ethicon.com.\n\nThe Software Engineer will make vital contributions to the Advanced Imaging product pipeline and transform patient care through innovation. They are responsible for working with our NPD teams to design and develop product software for use in cutting edge medical devices and associated capital equipment.\n\nKey Responsibilities:\n- Design and develop product software to integrate with mechanical, electrical, and distributed computing systems.\n- Develop test tools to test product software in an integrated environment.\n- Translate high-level customer needs into technical options while analyzing trade-offs and business impact.\n- Convert chosen technical options into formal testable written requirements\n- Document designs and specifications per design control processes.\n- Conform to Industry Standards for Medical Device Software (IEC 62304)\n\n\nJohnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability.",
    "title": "Software Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQHR9ZaPzxETaA/company-logo_100_100/0/1563996642116?e=1640822400&v=beta&t=GkEXKFe828AoiE8Amxos65GqUyZ8lX-pB6c3EXa3V98",
    "link": "https://www.linkedin.com/jobs/view/2725396149/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=sCpnGjGTc5jVJN2ePemvcw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "The Software Developer, Web Applications (Django) is responsible for creating products and experiences that present Crossway content to the marketplace with truth, beauty, and excellence. This role will be primarily focused on internal and external web applications. Remote candidates are acceptable, though preference will be given to those who can meet periodically in Wheaton, IL.\n\nResponsibilities include:\nDevelopment of existing and future web products and experiences\nRelated microsite, services, and API development\nWeb infrastructure maintenance\nOther duties as assigned",
    "title": "Software Developer, Web Applications (Django)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQHJ49As5SlE_g/company-logo_100_100/0/1551976088286?e=1640822400&v=beta&t=cGTUemBwFECKU7EbLkfM-XDc0JkOOblRlXJ0ZzHTzrw",
    "link": "https://www.linkedin.com/jobs/view/2709296480/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=fd%2BqVMC7OPE3Ga01zU0saw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "ASoftware Developer IIat O'Reilly Auto Parts develops and supports applications for internal and external systems including Inventory, Supply Chain, eCommerce, Retail Applications, Enterprise Search and more. Our teams are focused on the development, design and integration of various software systems, databases, and third-party packages utilizing tools and technologies including Java, JavaScript, Spring, Hibernate, SOLR, and SQL.\n\nEssential Job Functions\nPartner with developers, engineers and stakeholders to develop new features and to enhance and support existing applications and programs.\nWork with business systems analysts and stakeholders to translate business to technical requirements and problem solve.\nCollaborate with project teams and cross functional teams to troubleshoot open issues and bug-fixes.\nCollaborate, coach and mentor team members on best practices, code reviews, internal tools, and process improvements.\nWrite and maintain readable, sustainable, and efficient code in highly optimized and scalable architectures.\nOwn applications from conception and design, to implementation and support.\nDebug and test code as needed.\nCreate and update technical documentation.\nSkills And Qualifications\nCollege degree or equivalent work experience.\n1-2 years software development experience in a classroom setting or related job function, internships would qualify toward experience.\nEntry level knowledge of programming, database systems, and systems analysis and design.\nAbility to write technical documentation.\nGood problem-solving skills.\nGood verbal and written communications skills.\nMust work well in a team environment.\nAbility to learn independently.\nWillingness to work flexible schedule including nights/weekends.\nBenefits\n\nAll full time team members are eligible for a benefits package that is designed to offer convenience and security to our team members and their families. Programs, resources and benefit eligibility varies based on employment status, average hours worked, location and length of service. For detailed benefits info, please click here or type http://bit.ly/ORLYBenefits in your browser.\n\nCompensation Range\n\n$45,000.00 - $85,000.00 annually, pay will be based upon applicable experience, training and skills\n\nBonus\n\nThis job is eligible for an annual cash bonus based on individual goal achievement.",
    "title": "Remote Software Developer II"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQEDs1PcTaFM4A/company-logo_100_100/0/1616685622715?e=1640822400&v=beta&t=sUyPkV0e8j9k5VgnfeHQ_JzJ-jZDiVreQq3Nh2kHC3U",
    "link": "https://www.linkedin.com/jobs/view/2723268197/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=MLTL1cmdduGBwKYYJ1mKeA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Title: Java/Scala Software Developer\n\nResponsibilities\nDevelop and maintain platform backend codebase written in Java and Scala\nDevelop, benchmark, and troubleshoot SQL queries that access large amounts of data\nDevelop and maintain Elasticsearch queries for search and aggregation endpoints\nSupport on-call rotation during the day (not overnight)\nGain exposure to security industry concepts, learn how to build secure applications and fix vulnerabilities\nWork in a positive, independently-motivated working environment\nExperience Required\nExperience of 2 or more years in software development with a company supporting cloud software in production\nExcellent in Java/J2EE and Spring Framework\nProficient in writing, troubleshooting and optimizing SQL queries\nWilling to work with a global development team\nExperience in maintaining complex software systems – perform root cause analysis for production issues and provide tactical and long-term solutions. Perform impact analysis, exposure to profiling, analyzing thread dumps, heap dumps, etc.\nMust be willing to learn Scala\nPermanent resident of the US\nNice To Have\nExperience in other programming languages like Scala and Python\nExperience with following tools and tech:\nDocker\nNoSQL databases, especially Elasticsearch and Redis\nData ETL and message queues, especially Apache Flink, Apache Kafka\nGit\nAWS",
    "title": "Java/Scala Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQGVln5Y9oZHJw/company-logo_100_100/0/1626389201926?e=1640822400&v=beta&t=1MvIJgzq6xqWrGJfWbCPvIE6L2U9rYkz-gC0H-XISjE",
    "link": "https://www.linkedin.com/jobs/view/2722241823/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=5GeP0flYesFSeM%2ByttQK1g%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Spokeo is a people search engine that both enlightens and empowers our customers. With over 12 billion records and 14 million visitors per month, we reconnect friends, reunite families, prevent fraud, and more.\n\n\nWe’re looking to hire a Software Developer, Personalization to join our Customer Analytics Team. You will use Java, Ruby, Javascript, React, HTML, CSS, SQL, and more to enhance our full-stack web personalization infrastructure. You will join a cross-functional team of talented engineers, data scientists, and analysts to help integrate these solutions with our NextGen data and analytics platform.\n\nResponsibilities:\n\n• Design, build and improve data collection architecture for customer behavior events\n\n• Build analytics-driven product features that power key website real estate\n\n• Integrate tools to monitor analytics-driven services and provide insight into performance metrics\n\n• Monitor pipelines and services for issues and ensure identified bugs are routed and resolved\n\n• Create and maintain technical documentation and write well-abstracted, reusable, and efficient code\n\nRequirements:\n\n• Bachelor’s degree in computer science or equivalent knowledge and experience\n\n• 2+ years of web application development experience\n\n• Good knowledge of SQL and NoSQL data structures\n\n• Demonstrated advanced skills using Javascript, Ruby, and SQL\n\n• Experience implementing and troubleshooting high-usage, high-throughput systems\n\n• Experience optimizing website performance on both the client and server-side\n\n• Familiarity with analytics data tools like Google Analytics, Google Tag Manager, Tableau, etc.\n\n• Strong foundation in object-oriented programming, algorithms, and data structures\n\nExtra Points:\n\n• At least 5+ years of relevant experience in SQL, NoSQL, and web application development\n\n• Experience developing with cloud services such as AWS\n\n• Experience with services, microservices, and serverless environments\n\n• Understanding of event data collection tools like Segment, Tealium, mParticle, etc.\n\n• Knowledge of agile methodology and Scrum framework\n\n\nPrivacy Notice for Candidates: https://www.spokeo.com/recruiting-policy\n\n\nSpokeo is an equal opportunity employer. Applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Spokeo fosters a business culture where ideas and decisions from all people help us grow, innovate, create the best products, and be relevant in a rapidly changing world.\n\n\nRecruiters or staffing agencies: Spokeo is not obligated to compensate any external recruiter or search firm who presents a candidate or their resume or profile to a Spokeo employee without 1) a current, fully-executed agreement on file and 2) being assigned to the open position (as a search) via our applicant tracking solution.",
    "title": "Software Developer, Personalization"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQEcpWk-aV7Nmw/company-logo_100_100/0/1593699942398?e=1640822400&v=beta&t=XGn4itW5JuO_wlXIpTXJjZf_AUXEoqAG3V-Z07F2xKE",
    "link": "https://www.linkedin.com/jobs/view/2727056026/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=MVUqsaluHHPyJoWgB93bRw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "You’ve worked hard, put the hours in to complete your degree and now you’re ready to start your tech career, what next? While these are uncertain and anxious times, there is hope.  \n\nHere at mthree, we pair talented graduates with leading global businesses. We’re always on the lookout for ambitious graduates to join the mthree Alumni Graduate Program, kick-starting your tech career within an entry-level Full-stack Developer role and working onsite with a leading fintech organization in various locations throughout the USA. We are currently recruiting graduates to join our training program from May, with the opportunity to land a role with one of our leading Fortune 500 partners. \n\nOur 24-month graduate program begins with 8 weeks of paid training and career coaching, where you’ll learn everything you need to hit the ground running as a software developer. From the comfort of your own home, you’ll start training through interactive webinars with our expert instructors as well as individual study and group projects with other trainees. Over the course, you'll learn how to design, develop, and test a full-stack Java application in a corporate technology environment. \n\nAfter you've completed the paid training, you'll have the opportunity to fast-track your career at a global investment bank or leading tech company. \n\nWhat you’ll do: \nIf successful, you’ll work with one of our clients as a software developer, designing, developing and maintaining complex applications in a global team environment. \nMost commonly using Java, C++ or GoLang (Go), software developers will work with key stakeholders across the business to create, test and improve the applications that play a fundamental role in the company’s daily operations. You will work across the software development lifecycle, gaining essential grounding in handling requirements, support and maintenance, while following an Agile methodology to constantly strive for better results and becoming indispensable to your team \n\nWhat you need: \nB.S., Computer Science or within a STEM related subject  \n3.0 GPA or higher OOP development experience  \nSolid software engineering principles (data structures, OO, design patterns, multithreading)  \nGood trouble shooting and debugging skills  \nWorking knowledge of database concepts (SQL, stored procs, schema design)  \nUnderstanding of the formal software development lifecycle (SDLC)  \nUnderstanding of test-driven development  \n\nWhat you’ll receive: \nFully paid, in-depth and interactive training with a diverse group of like-minded graduates, delivered by experts with working knowledge of the field. \nA competitive graduate salary \nPay increases every 6 months \nA flexible benefits package including gym membership \nOngoing training and pastoral care \nInvaluable industry experience and the opportunity to start a career in a desirable and competitive industry \n\nTo be considered for this role, you must be open to relocating throughout the US. Please get in touch for more information on our program and roles. \n\nWe take great pride in celebrating the diversity of each and every individual who contributes to making mthree the company it is today and will be in the future. We value diversity both within mthree and with our partner companies, and we’re proud to provide an environment where all our colleagues can flourish by promoting a strong culture of equality but most importantly, inclusion. We never want people to change - only add to the amazing mix of people that work for mthree. ",
    "title": "Junior Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4E0BAQHY-1dsySpP3g/company-logo_100_100/0/1561059860747?e=1640822400&v=beta&t=6LAe4cTr3f5jnJIlib8GCDi1nF6OKo4D5cKoSR6uaZ8",
    "link": "https://www.linkedin.com/jobs/view/2729693177/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=wRXdSRDrwCKk4duqyhXX6g%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Software Engineer I\nIf you are looking for a role to jump start your career, that is fundamentally foundational at its core, then look no further as our Software Engineer I role might be for you! We are looking for an eager, ready to learn and team focused individual who strives to be hands on in understanding how to code properly and learn new concepts and theories that will push the product team forward.\nWe are looking for a motivated and energetic individual to join our team that is a fun and challenging multi-disciplinary group, who work together on dedicated projects in one of the many areas of our product delivery. They bring a passion for technology and a desire to work as a part of an agile development team and are eager to learn the best modern software development practices.\nKey Responsibilities:\nWork in an Agile environment and be involved in all technical activities within the team such as estimating, sprint planning, software development life cycle activities, code reviews, research, deployments, and documentation creation.\nParticipate on a cross-functional team to solve challenging software bugs & performance issues.\nContribute as a full-stack developer, working closely with our database, back-end and front-end stacks.\nEnsure software deliverables align with the technical architecture, development standards and quality practices.\nDevelop well documented, intent-revealing code.\nAssist in automating the deployment of your team’s code, and monitor in a live environment\nParticipate in peer review activities.\nParticipate in a learning environment through collaboration, shared knowledge, and leadership.\nKey Requirements:\nA university degree in Computer Science, Software Engineering or similar technology field (Bachelor’s degree or equivalent professional experience).\nPassion for improving the customer experience.\nSelf-motivated and driven to meet long term goals.\nAbility to independently manage time to meet project deadlines.\nStrong interpersonal skills and ability to work collaboratively with other team members.\nExcellent written and verbal communication skills.\nCan operate under tight deadlines.\nSolid Object-Oriented Programming (OOP) skills.\nDesire to write clean, well-factored code based on S.O.L.I.D. principles.\nUnderstanding Object-Relational Mappers such as Entity Framework or Dapper.\nTechnologies we use:\nC#, MVC, Web API, CSS, HTML/JavaScript, jQuery, AngularJS, Dapper, SQL Server, SSRS\n\nThe Company:\nTMA Systems (TMA) is a technology company located in Tulsa, Oklahoma. For more than 30 years, TMA has been transforming organizations by providing facility professionals with the most technologically advanced Maintenance Management solutions available. \nUtilizing WebTMA, TMA’s flagship solution, organizations can manage their strategic assets throughout their entire lifecycle. Our comprehensive web-based solutions are tailored to a variety of industries that have a desire to effectively streamline maintenance operations. TMA is setting new standards for organizations to account for, maintain, and extend the useful life of their physical assets. In a budget conscious world, TMA provides a solution that will maximize return-on-investment (ROI). \n We are a global organization with over 1,500 clients that has developed industry-leading solutions based on what our clients need to be successful. How do we achieve this? We solicit our clients and take the time to understand how our products are used in their business; coupled with a culture that produces world-class people with a client-service mindset. At TMA we realize that success is only possible with team members that share our passion for excellence.  \nCare to join us?\nWhy work at TMA Systems?\nCompetitive compensation plan.\n401(K) Contribution.\nEmployer paid benefits: health, dental and vision.\nProfessional development plans.\nCareer progression/internal mobility opportunities.\nInclusive work environment.\nVolunteering opportunities.\nCompany/team building events.\nThis role allows employee to have a hybrid remote working option (work from home and work from office options).",
    "title": "Software Engineer I (Hybrid)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQFBqSfVgq9yaA/company-logo_100_100/0/1625232344814?e=1640822400&v=beta&t=MDJ84VloyTlVfZFK11D_CK0iwozosOgEYTcVvi5r3PE",
    "link": "https://www.linkedin.com/jobs/view/2731077940/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=1Z9GObrPol%2FOT5eeXkJCGw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Dwolla is one of the fastest growing financial technology companies in the United States and has been recognized as one of the world’s most innovative companies. We believe in challenging the status quo and building teams with diverse experiences, ideas and people. Joining the team at Dwolla means entering an always evolving, fast-paced, remote-first work environment. Your unique skills and talents will help build a world that can move money simply and securely, giving businesses the tools they need to access the ACH or RTP® Networks and improve their payment processes. At Dwolla, we are never done.\n\nWe care about mastering the ideal platform to move money simply and securely. At Dwolla, you will be empowered to select the right languages, tools, and libraries for the job and deliver products based on those choices. If you want to become a master of your craft while building a platform that moves millions of dollars every day, Dwolla may be right for you.\n\nAs a Product Software Engineer, you'll design & build the products and services that power the Dwolla Platform. From public APIs and user interfaces to internal operational systems and 3rd party integrations, the solutions you build will solve real customer problems.\n\nWhat will you work on in your first few months?\nBuild systems with techniques like Test Driven Development and programming languages such as Scala, JavaScript, Java, C#, and Python (and we’re open to learning more)\nFollow an API-first approach to solving customer needs\nDesign & deploy solutions with containerized microservices using technologies like AWS, Docker, Lambda, ECS, Thrift, Finagle\nHelp care for systems by keeping them up-to-date, adding features, refactoring code, and fixing bugs\nCollaborate with the team via code reviews and architecture discussions\nParticipate in product planning using Agile methodologies\n\nTo learn more about the types of projects we work on, check out these blog posts highlighting some work by the team:\nThe Value of Webhooks for API Customers\nDetect Fraudulent Behavior with Bank Account Fingerprinting\nPlaid’s Bank Verification + Dwolla’s ACH API\n\nWe're excited to talk if you have the following experience:\n2+ years of professional software development experience\nDeveloped applications using object oriented or functional programming languages such as Scala, JavaScript, Java, C#, Python, Go, Ruby, PHP, Perl\nAre familiar with and excited about Agile/XP software development practices for delivering projects\n\nPerks to working at Dwolla:\nCompetitive salaries\nStock Options\nGenerous Paid Time Off\n12 weeks paid parental leave\nPaid parking or public transportation stipend\nMedical, dental & vision insurance\nLong-term disability insurance\nMedical leave\nLife Insurance\nFlexible Spending Accounts\nCasual dress\n\nNoteworthy Items:\nOur office is located in downtown Des Moines.\nWe are open to both local and permanently remote candidates for this role.\n\nAt Dwolla, we value diversity and hold the core belief that the best teams are built by the inclusion of diverse ideas, experiences, and people.\n\nJoin our team and bring your unique perspective to help build the ideal platform to move money simply and securely.\n\nWe are able to sponsor visas.",
    "title": "Product Software Engineer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQHjoMS1FU87Fg/company-logo_100_100/0/1584045405065?e=1640822400&v=beta&t=QN58CrypT7THq03RkFxzdRkpudfAVfIT6t0aFnZHn9k",
    "link": "https://www.linkedin.com/jobs/view/2729091794/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=idY22Q0fylGPsyWgxF2bqA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Position Description\n\nDynetics, a Leidos company, is seeking a talented Software Engineer to join a diverse team to create unique solutions for complex problems. With offices across the United States engaging in the defense, space, cyber and commercial fields, Dynetics provides responsive, cost-effective engineering, scientific and IT solutions.\n\nThe Software Engineer will be capable of contributing to efforts to develop requirements, design, implement, test, and integrate software to support various applications. Software development includes but is not limited to user interface applications, data verification tools, modeling and simulation based applications, hardware integration/communication, and artificial intelligence.\n\nThis developer will be working with a highly technical team in developing solutions to meet our customer needs. Examples include software and hardware integration, front-end and back-end application development, stand-along application suites, web applications, and artificial intelligence solutions. The team consists of developers with strong fundamental skills that value using best practices, exercising peer reviews, and exceeding customer expectations.\n\nThe candidate must be comfortable in a fast-paced working environment and be a motivated, independent learner.\n\nThe candidate must be highly organized with a strong technical background and attention to detail.\n\nBasic Qualifications\nCandidate must be working toward Bachelors or recently graduated with Bachelor’s in Computer Science, Computer Engineering, or equivalent degree from an ABET-accredited university.\nCandidate must have 0 to 5 years of experience working within a highly technical software development project-oriented environment.\nCandidate must demonstrate strong competency in software development in one or more of the following languages:\nC/C++, C#, or Java and possesses aptitude for good software design techniques\nThe position requires a self-disciplined individual with good people skills, verbal skills, writing skills, and strong technical interests/capabilities.\nCandidate must be able to effectively collaborate within a team environment.\nCandidate must demonstrate knowledge of Windows Operating systems.\nCandidate must be a resident of the North Alabama area or willing to relocate to Huntsville – North Alabama, AL area.\nOther Qualifications\n\nPreference shown to candidates who have experience and/or working knowledge with:\nKnowledge of additional programming languages (Python, FORTRAN, MATLAB, LabView)\nFull-stack development\nAgile methodologies i.e. Scrum\nCMMI\nEmbedded system development\nAutomated software test development\nCustomer Engagement\nSecurity Requirements\n\nCandidate must be a US Citizen and possess (and be able to maintain) a Final Secret Clearance or meet the eligibility to obtain (and maintain) a Secret Clearance.\n\nJob Number\n\n01.01.13-2021-52\n\nClosing Date\n\n11/23/2021",
    "title": "Junior Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQHXCsHVZHoJ3g/company-logo_100_100/0/1631103953073?e=1640822400&v=beta&t=mo4uji8cT5yngaxRc4E46YRubHe6GDy-qd-Z8oNNIc8",
    "link": "https://www.linkedin.com/jobs/view/2736267812/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=W0Usp2P%2FcnBJa1dzkPWXYw%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Who We Are\n\nBandwidth lives for innovation! Our technology powers brands like Google, Microsoft, GoDaddy, Arlo, Netgear, Zoom, Rover and more of the most exciting leaders in technology. Our intelligent voice, messaging, 9-1-1 access, and phone number services— all backed by Bandwidth’s own nationwide, all-IP voice network—allow us to power the way people communicate, connect, and do business.\n\nAt Bandwidth, your music matters when you are part of the BAND. We celebrate differences and encourage BANDmates to be their authentic selves. #jointheband\n\nWhat We Need\n\nWe’re looking for a Software Developer (Messaging) who will design and develop solutions for reputation management and number provisioning. You are the right candidate if you enjoy having a mission-focus, solving complex problems at scale, and working closely with stakeholders to continually improve the customer experience.\nYou will create and maintain REST APIs, customer-facing dashboards, and the infrastructure that powers it all.\nYou enjoy an iterative, MVP-first environment.\nYour team will enjoy full end-to-end ownership of your services, from design to operations and monitoring in production.\nWhat You'll Do\n\nIn messaging, we process billions of messages per month, via a variety of communication channels - empowering customers to communicate freely at scale and not worry about our capacity.\n\nYou'll Also\nContribute to solutions from start to finish, collaborating across teams to iteratively ship value.\nWork with a team of developers with experience with distributed microservices and full stack systems.\nWork closely with product managers to create solutions that deliver the power to communicate.\nWhat You'll Need\n\nIf you're our person, you probably look like this:\nApplicants should have 2+ years of experience building web services in a modern programming language (such as Java, C#, or Go).\nExperience with front-end development, preferably with React.\nAn understanding of network protocols, HTTP, and REST.\nExperience with test automation patterns and frameworks.\nSolid written and verbal communication skills in English.\nA 4-year technical degree or equivalent experience.\nLittle Extra From You\n\nWow, It’d Be Really Great If\nYou have expertise in Java and Spring.\nYou’ve built and deployed applications for the cloud, preferably AWS.\nYou have experience with scale and performance optimization.\nYou have experience with relational and non-relational database systems.\nAre you excited about the position and its responsibilities, but not sure if you’re 100% qualified? Do you feel you can work to help us crush the mission? If you answered ‘yes’ to both of these questions, we encourage you to apply! You won’t want to miss the opportunity to be a part of the BAND.\n\nLittle Extra For You\n\nAt Bandwidth, we’re pretty proud of our corporate culture, which is rooted in our “Whole Person Promise.” We promise all employees that they can have meaningful work AND a full life, and we provide a work environment geared toward enriching your body, mind, and spirit. How do we do that? Well…\nYou’re guaranteed to be given “work that matters.” If you ain’t feelin’ that, let us know. We’ll fix it.\nWith our Hacker Hours program, you get protected time to learn, experiment, and build with the technology you want to! You can even submit projects to our yearly Hack-of-the-Year competition complete with awards and prizes.\nWhen you’re on vacation, nobody is allowed to contact you. No calls, texts, emails… Enjoy your time off.\nHealth: We pay 100% for benefits coverage including Medical, Dental, Vision, Prescription, Life, and Disability. Corporate chaplains, EAP and 401K match.\nFitness: 90-minute fitness lunch with a paid gym membership with shuttle service available for workouts. On-site cardio gym, locker room/showers, classes, and sponsored sports and leagues. Nutritionist and personal trainer on-site.\nVolunteer: We have a program dedicated to providing volunteer opportunities to employees, Bandwidthcares.\nCompetitive compensation: $80,000 – $120,000\nAre you excited about the position and its responsibilities, but not sure if you’re 100% qualified? Do feel as you can work to help us crush the mission? If you answered ‘yes’ to both of these questions, we encourage you to apply! You won’t want to miss the opportunity to be a part of the BAND.\n\nApplicant Privacy Notice",
    "title": "Software Developer (Messaging)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C4D0BAQEpBYagiK3vWA/company-logo_100_100/0/1519856551676?e=1640822400&v=beta&t=Qs26qOvmDLDZVttZ-83kpDkzNwWAD9yYOiPQnOejLUA",
    "link": "https://www.linkedin.com/jobs/view/2735874257/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=HOGImTOP87abkj5%2FUL6mlg%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Junior Software Developer\nDallas, TX\nContract to Hire\n\nAs the Junior Developer for a Fortune 75 airline company, you will be responsible for development and data analysis of digital marketing product applications.  \n MINIMUM QUALIFICATIONS\nBachelor’s degree in Computer Science, Computer Engineering, Technology, Information Systems (CIS/MIS), Engineering or related technical discipline or equivalent experience/training\n0-1 year of experience in Object Oriented Programming and/or web development\nStrong experience in Java Development\nFamiliarization with modern software development practices (SDLC and Agile)\nAbility to work with others in a team-oriented environment\nExcellent problem-solving skills; strong logical reasoning and solution oriented\n·        Ability to effectively communicate both verbally and written with business & IT teams\n\nRESPONSIBILITIES\nUtilize tools to design, configure, code & analyze data for web applications\nKeeps current on new features for our digital tools as well as keeping current on the ever-changing digital marketing technology to ensure that we are fully utilizing our current tools as well as have the right tools in our stack\nBuilds and manages relationships with stakeholder’s to solution data requirements to fit their needs\nBuilds and manages relationships within our technology teams in support of our tools and analytics tracking\nConducts quality assurance checks and data validation, identifies data collection issues and gaps, recommends and implements fixes\nDefines best practice approaches for analyzing user behavior on the online channels, for configuring web analytics technology, and for interpreting data\nTeaches, trains, and guides other analysts with respect to writing analytics requirements\nFosters best practices and reviews quality of output\n\n\nBrooksource provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, national origin, age, sex, citizenship, disability, genetic information, gender, sexual orientation, gender identity, marital status, amnesty or status as a covered veteran in accordance with applicable federal, state, and local laws.",
    "title": "Junior Software Developer"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQEbC0jkrtiZtw/company-logo_100_100/0/1625612069584?e=1640822400&v=beta&t=LgvIv2lrb8qT8E273Lf-nsEKJNRouDY_Rfhbt9tUehk",
    "link": "https://www.linkedin.com/jobs/view/2730810352/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=VWV1cZRE3T5Mm4XbimushA%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "Remitly is on a mission to transform the lives of immigrants and their families by providing the most trusted financial products on the planet. For nearly 10 years, we have been tirelessly delivering on our promises to immigrants sending their hard earned money home. Today, we are proud to have served millions of customers globally with Remitly and our newly launched Passbook app to provide immigrants access to banking. We strive daily to meet our promise to our customers by building peace of mind into everything we do. Join over 1,300 employees across 9 offices who are growing their careers while having a positive impact on people globally.\n\nAbout The Role\n\nAs a Mobile App Experience (APPX) engineer, you will push the boundaries of client-side development, leading projects that expand the capabilities of both our customers and our engineers. APPX owns the front-end platform and we're looking for engineers that are passionate about learning, experimenting with, and scaling our system in pursuit of the best financial services for immigrants around the world.\n\nWe have countless daunting technical challenges ahead of us, and we believe that a learning mindset is the most important tool when trying to achieve lofty goals.\n\nWhat You'll Do\nContribute to the ideation, technical architecture, and development of areas of our platform with a data-driven and customer-centric viewpoint.\nExpand our React Native + TypeScript codebase with new tools and abstractions to support test automation, service-driven UI, request caching, and more.\nAdvocate for users and developers alike in a dynamic role.\nExperiment with new technologies and grow your skills in a supportive environment.\nReport to the App Experience engineering manager.\nYou Have\nDegree in computer science and 2+ years of software development experience or equivalent.\nExperience building client-side applications.\nProficiency in one of the following programming languages: TypeScript, JavaScript, Kotlin, Java, Swift, Go, or Objective-C.\nA grasp of data structures.\nExperience working with product managers to solve customer problems.\nOur Benefits\nUnlimited paid time off\nHealth, dental, vision benefits and a 401k plan with company matching\nCompany contributions to your HSA or FSA plan, if you choose one\nContinuing education and corridor travel benefits\nScholars program\nDistributed work (in-person work options, but also remote friendly)\nRemitly is an Equal Opportunity Employer. Equal employment opportunity has been, and will continue to be, a fundamental principle at Remitly. We are committed to nondiscrimination across our global organization and in all of our business operations. Employment is determined based on personal capabilities and qualifications without discrimination on the basis of race, creed, color, religion, sex, gender identification and expression, marital status, military status or status as an honorably discharge/veteran, pregnancy (including a woman's potential to get pregnant, pregnancy-related conditions, and childbearing), sexual orientation, age (40 and over), national origin, ancestry, citizenship or immigration status, physical, mental, or sensory disability (including the use of a trained dog guide or service animal), HIV/AIDS or hepatitis C status, genetic information, status as an actual or perceived victim of domestic violence, sexual assault, or stalking, or any other protected class as established by law.\n\nRemitly is an E-Verify Employer",
    "title": "Software Developer, App Experience (Seattle or US Remote)"
},{
    "img": "https://media-exp1.licdn.com/dms/image/C560BAQFm4emV_bOSFQ/company-logo_100_100/0/1588000125767?e=1640822400&v=beta&t=VNd3GdiSqiGFzTZAJD8nWW4j_DT6U8MzRBLaTN69a0E",
    "link": "https://www.linkedin.com/jobs/view/2737506496/?alternateChannel=search&refId=5ZdD1HJtgw591ZBD3F%2FT1w%3D%3D&trackingId=r76g8QrEvPO%2BJFyEWC7c2w%3D%3D&trk=d_flagship3_search_srp_jobs",
    "text": "ProSight is looking for experienced and motivated candidates who combine strategic thinking, creativity, and technical skills to drive results at a fast growing, dynamic company. ProSight’s business model focuses on specific customer niches and delivers a competitive advantage through a deeper understanding of the customer and superior underwriting execution.\n\nEntry Level Software Developer will build and enable new products and capabilities in the policy administration system. This role will have responsibility to develop and implement using the Duck Creek Commercial Lines platform. Candidate will work closely with the architects, delivery and support teams to understand business objectives and enable optimal solutions.\n\nResponsibilities\nConfigure pages and forms to implement the proprietary products and business verticals\nSetup tables and implement rules to meet business and system requirements\nConfigure circulars and proprietary filings (loss costs, company exceptions, rate, rules and forms)\nDevelop comprehensive unit test cases to verify new or modified forms and rates\nPartner with the production support team to troubleshoot and resolve production issues and maintain system compliance related to bureau and proprietary rate, rules and forms\nDevelop, unit test, support, promote and document changes, adhering to the development standards\nPerform code reviews\nProvide support during quality assurance to ensure that the functionality is working as expected\nEnsure industry best practices are applied when developing solutions including performance, usability, security, data retention, scalability, experience and other productivity considerations\nKeep abreast of Duck Creek product roadmap and the industry trends\nQualifications\nExperience with programming is preferred\nKnowledge of C#, Java, SQL, XML, XSLT, ASP.NET, Javascript, CSS, HTML is desired\nExperience working with relational databases\nHighly analytical and structured thinking, with the innate curiosity and creativity to develop innovative and unorthodox solutions to problems\nStrong interpersonal skills, to help negotiate priorities and to resolve conflicts among stakeholders\nEffective verbal and written communication skills\nExcellent organizational skills and attention to details\nExpertise in Microsoft Office Suite\nBachelor’s or Master’s degree in Computer Science, Information systems or other related field",
    "title": "Entry Level Software Developer"
}]